{"about": "A top-tier oilfield service company with a century-long track record, Baker Hughes delivers solutions that help oil and gas operators make the most of their reservoirs.\n\nCollaboration is the foundation on which we build our business. We listen to our clients to understand their unique challenges and then develop solutions designed to help manage operating expenses, maximize reserve recovery, and boost overall return on investment throughout the life of an oil or gas asset.\n\nWith 53,000-plus employees in more than 80 countries, our local geomarket teams work side by side with customers to engineer reliable application-specific products and services that create more value from the reservoir whether the application is deepwater, unconventional hydrocarbons or production and water management.\n\nOur history of technology innovation is a cornerstone of our success. Local teams are supported by global centers of excellence where scientists push the boundaries of value-adding technology to find solutions for progressively more complex technical challenges.\n\nAt dedicated innovation centers, scientists conduct applied and game-changing critical research. We collaborate with customers to jointly develop technology for specific industry needs at regional technology centers. Engineers and scientists at our product centers work on next-generation products and services for drilling and evaluation, completions and production, and fluids and chemicals.\n\nAt Baker Hughes, we are looking forward to the next 100 years of working side by side with our customers to continue expanding the limits of oil, gas and alternative energy drilling, completion and production through innovation problem solving.", "name": "Baker Hughes | BakerHughes.com", "members": [{"name": "Jody Rudd", "description": ""}, {"name": "Martin Craighead", "description": " \r\n\tMartin Craighead is Chairman and Chief Executive Officer of Baker Hughes Incorporated. Craighead joined Baker Hughes in 1986 and served as the company’s President and CEO from January 2012 until assuming his current role. Prior to this position, he held responsibilities as President and Chief Operating Officer from 2010 to 2012, Senior Vice President from 2009 to 2010, and Chief Operating Officer in 2009. His career at Baker Hughes includes a three-year tenure as Group President for the Drilling and Evaluation business, as well as various technical and operational roles throughout the Americas and the Asia Pacific region. \r\n\tCraighead holds the International Executive Master of Business Administration degree from Vanderbilt University and earned a Bachelor of Science degree in petroleum and natural gas engineering from the Pennsylvania State University. He is the recipient of the 2010 C. Drew Stahl Distinguished Achievement Award at Pennsylvania State."}, {"name": "Belgacem Chariag", "description": " \r\n\tBelgacem Chariag is Vice President and Chief Integration Officer leading the integration of the proposed Halliburton merger for Baker Hughes Incorporated. His previous role was President of Global Products and Services for the company. He also served as President and Vice President of the company’s Eastern Hemisphere operations from 2009 until 2013. Prior to joining Baker Hughes, Chariag was Vice President of Health, Safety, Environment, and Security for Schlumberger. He also headed Schlumberger’s businesses in Egypt, East Africa, and the East Mediterranean. Chariag held a variety of leadership and management positions for the company, including President of the Well Services business and Marketing Vice President for Europe, Caspian, and Africa, as well as a variety of field operations, technical support, and management positions in Angola, Tunisia, the UAE, and Qatar. \r\n\tChariag earned a Master of Business Administration degree in global energy from the University of Calgary and a Bachelor of Science degree in petroleum engineering from the University of Texas."}, {"name": "Alan Crain", "description": " \r\n\tAlan Crain is Senior Vice President, Chief Legal and Governance Officer of Baker Hughes Incorporated. He joined Baker Hughes as Vice President and General Counsel in 2000 and was named Senior Vice President in 2007. Crain has broad experience as a corporate legal executive. He served as Executive Vice President, General Counsel, and Secretary for Crown Cork & Seal Company, and as Vice President and General Counsel for Union Texas Petroleum. Crain also has held legal positions at Pennzoil and El Paso Energy. \r\n\tCrain earned a Juris Doctor degree and a Master of Business Administration degree from Syracuse University, in addition to a Master of Science degree and a Bachelor of Science degree both in management engineering from Rensselaer Polytechnic Institute."}, {"name": "Archana Deskus", "description": " \r\n\tArchana (Archie) Deskus is Vice President and Chief Information Officer (CIO) of Baker Hughes Incorporated. She previously served as Vice President and CIO for Ingersoll-Rand and has more than two decades of experience in the aerospace, industrials, and consumer products industries. She worked at United Technologies for 19 years with positions of increasing responsibility, including Executive Director, Infrastructure and E-Business at Pratt & Whitney, and Vice President and CIO at Carrier North America. She also worked as Senior Vice President and CIO for Timex Corporation. \r\n\tDeskus earned a Bachelor of Science degree in business administration/management information systems from Boston University and a Master of Business Administration degree from Rensselaer Polytechnic Institute."}, {"name": "Andy Esparza", "description": " \r\n\tAndy Esparza is Vice President and Chief Human Resources Officer for Baker Hughes Incorporated. He has more than 30 years of HR management experience, specializing in helping organizations improve their HR strategies. Esparza previously served as an executive HR consultant, providing services to chief executive officers and senior executives. He worked at Dell Inc., from 1997 to 2010 where he served in various leadership roles including Chief HR Officer, Vice President of Human Resources for the Europe, Middle East, and Africa regions, and Vice President of Staffing. In addition to his human resources experience, Esparza is a member of the boards of directors for the Campanile Foundation at San Diego State University and the Andy Roddick Foundation. \r\n\tEsparza earned a Bachelor of Science degree in business administration from San Diego State University."}, {"name": "Jack Hinton", "description": " \r\n\tJack Hinton is Vice President, Health, Safety, and Environment (HSE) for Baker Hughes Incorporated. With 38 years of experience, he is widely known across the industry for strategic insights that are efficient, effective, and yield step-changes in HSE management. Before Hinton joined Baker Hughes in 2005, he was a dean and professor at the Kazakhstan Institute of Management, Economics, and Strategic Research for two years. He previously spent 26 years at Texaco serving in leadership roles that included Director of Environment, Health, and Safety; and Vice President of International Petroleum. \r\n\tHinton presently sits on the Management Committee of the International Association of Oil and Gas Producers, is a member of the Kazakh-British Technical University Business School Advisory Board, and serves as Chairman of the Board of Advisors for the Southwest Center for Occupational and Environmental Health. \r\n\tHe holds a Doctorate degree in occupational health and a Master of Science degree in environmental science, both from the University of Texas. Hinton also received a Bachelor of Science degree in biology and chemistry from Trevecca Nazarene University."}, {"name": "Julio Lera", "description": " \r\n\tJulio Lera is President, Latin America of Baker Hughes Incorporated. Before this appointment, he was Managing Director and Vice President of Latin America for the company. Lera joined Baker Hughes in 1983 and held responsibilities as Vice President of the Centrilift product line in Latin America from 2007 to 2009 and Managing Director and Vice President of the Southern Cone Geomarket from 2009 to 2013. He has more than 30 years of experience in strategy, operation, manufacturing, marketing, and sales. Lera earned a degree in civil engineering from Catholic University of Buenos Aires and a degree in petroleum engineering from the University of Buenos Aires. "}, {"name": "Derek Mathieson", "description": " \r\n\tDerek Mathieson is Vice President and Chief Strategy Officer of Baker Hughes Incorporated. Mathieson’s previous positions at Baker Hughes include President, Western Hemisphere; President, Products and Technology; and Chief Technology and Marketing Officer. He joined Baker Hughes in 2008 from WellDynamics Incorporated, where he served as Chief Executive Officer. His oil and gas career also includes roles at Shell Exploration & Production and Wood Group in the United Kingdom. \r\n\tMathieson earned a Ph.D. in micro electro-mechanical systems and a bachelor’s degree in electrical and electronic engineering from Heriot-Watt University in Edinburgh, Scotland, and was recently awarded an honorary doctorate in engineering from that institution. He is a chartered engineer with the United Kingdom Engineering Council, a member of the Institute of Engineering and Technology, and an active member of the Society of Petroleum Engineers."}, {"name": "Khaled Nouh", "description": " \r\n\tKhaled Nouh is President, Middle East and Asia Pacific for Baker Hughes Incorporated. Before this appointment, he served as the company’s President, Middle East, from 2009 to 2013. Nouh began his career with Saudi Aramco in 1990 and joined Schlumberger in 1994 as a field engineer. After several operational positions in various Middle East countries, Nouh held Global Marketing, Human Resources and line management positions. He was then given responsibility for Schlumberger's geomarkets in Libya and Saudi Arabia before being appointed Vice President, Integrated Project Management, for the Middle East and East Mediterranean region. \r\n\tA native of Saudi Arabia, Nouh earned a Bachelor of Science degree in mechanical engineering from King Saud University in Riyadh."}, {"name": "Kimberly Ross", "description": " \r\n\tKimberly Ross is Senior Vice President and Chief Financial Officer (CFO) of Baker Hughes Incorporated. She joined Baker Hughes in 2014 from Avon Products Incorporated, where she served as Executive Vice President and CFO. Prior to her association with Avon, Ross served as Executive Vice President and CFO of Royal Ahold N.V. from 2007 to 2011 and held various other finance positions at Royal Ahold from 2001 to 2007. \r\n\tRoss earned a Bachelor of Arts degree in accounting from the University of South Florida and became a certified public accountant after graduation. She serves on the board of directors and the audit committee of ACE Ltd."}, {"name": "Mario Ruscev", "description": " \r\n\tMario Ruscev is Vice President and Chief Technology Officer of Baker Hughes Incorporated. Ruscev has more than 30 years of technology and operations experience in the oilfield services industry. He joined Baker Hughes from Geotech Seismic Services, where he served as Chief Executive Officer. Ruscev previously served as CEO of FormFactor and spent more than 20 years with Schlumberger in a number of senior roles in France, the United Kingdom, and Norway. \r\n\tRuscev earned a doctorate degree in nuclear physics from the Pierre and Marie Curie University in Paris, and a Ph.D. in nuclear physics from Yale University. He is a Director of the Global Carbon Capture and Storage Institute."}, {"name": "Art Soucy", "description": " \r\n\tArthur (Art) Soucy is President, Europe, Africa, and Russia Caspian for Baker Hughes Incorporated. Prior to his current role, Soucy served as President, Global Products and Services for the company. He also served as Vice President, Supply Chain, where he was responsible for sales and operations planning, manufacturing, purchasing, transportation and logistics, and quality. Before joining Baker Hughes, he was Vice President, Global Supply Chain, for Pratt & Whitney, and held a variety of management roles with that firm prior to his Vice President assignment. He also spent 10 years at Hamilton Standard, serving in various manufacturing, engineering, and product development management roles. \r\n\tSoucy earned a Master of Business Administration degree from the Massachusetts Institute of Technology and a bachelor’s degree in international business from Lesley University in Massachusetts."}, {"name": "Richard Ward", "description": " \r\n\tRichard Ward is President, Global Products and Services for Baker Hughes Incorporated. He previously served as President, Completions and Production for the company. His executive roles also include President of the company’s Asia Pacific region and Vice President, Middle East Asia Pacific region for Baker Oil Tools. Ward has a strong background in business management, operations, business development, sales and marketing, integrated operations, and large account management. He also has a background in drilling engineering and geological interpretation. Ward has broad international experience, having lived and worked in Europe, Africa, Middle East, Asia Pacific, and the United States."}, {"name": "Richard Williams", "description": " \r\n\tRichard Williams is President, North America for Baker Hughes Incorporated. He previously served as President of the U.S. Land and Gulf of Mexico regions. Since joining Baker Hughes in 1975, he has held positions of increasing responsibility, including executive roles in operations for the Completions and Drilling Fluids product lines, and has provided a broad base of global experience across the hydrocarbon asset life cycle. \r\n\tWilliams holds a Bachelor of Science degree in business administration from the University of Phoenix and an Associate of Science degree in petroleum technology from Lincoln College. He is on the boards of directors of the Center for Offshore Safety and the National Ocean Industries Association and is a member of the Society of Petroleum Engineers, Independent Petroleum Association of America, and Petroleum Equipment Suppliers Association."}]}