{"about": "Cellana, a leading developer of algae-based bioproducts, uses the most productive plants on earth—marine microalgae—to photosynthetically produce its ReNew™ line of Omega-3 EPA and DHA oils, animal feed, and biofuel feedstocks.\n\nCellana’s patented ALDUO™ system, a series of photobioreactors (PBRs) coupled with open ponds, enables economic and continuous production of diverse strains of microalgae.\n\nOur ALDUO™ system represents the optimal balance between higher-cost PBRs and lower-cost open ponds for consistent production without interruption by contamination.\n\nSince 2009, Cellana has operated its Kona Demonstration Facility, a 6-acre, state-of-the-art production and research facility in Hawaii. To date we have generated over 20 tons of algae to become one the most validated and prolific algae production facilities in the world.\n\nVideo: Cellana’s Kona Demonstration Facility, a 6-acre, state-of-the-art production and research facility in Hawaii, and the ALDUO™ algae production technology\n\nOver $100 million has been invested in the technologies being developed by Cellana, including through angel investments, government grants and contracts, strategic partner/joint venture funding, and investments made in the technologies in-licensed by Cellana.\n\nCellana intends to construct and operate commercial facilities to produce our ReNew™ product line as integrated algae-based biorefineries.\n\nAt Cellana, it’s a brand ReNew day! Please contact us to learn more about our company and products.", "name": "Home", "members": [{"name": "David Anton, PhD", "description": " Dr. Anton has served as COO of Cellana since January 2015. He brings nearly 30 years of relevant experience to the company, including prior technology and business leadership roles at some of the industry’s most innovative companies. Prior to joining Cellana, Dr. Anton held the position of  Executive Vice President and Chief Technology Officer at Joule in which he led the transition of Joule’s CO2-to-fuels technology into a commercial reality. Dr. Anton spent five years at Codexis in multiple leadership roles, including Senior Vice President of Bioindustrials, Chief Technology Officer and Senior Vice President of Process Development & Manufacturing. During his tenure, he oversaw development and commercial application of the company’s bioindustrial platform and led the global R&D and manufacturing organization. He previously spent 25 years at DuPont in multiple senior management positions across bioprocessing and biocatalysis, including the role of global business lead for development of DuPont’s advanced biofuel. Dr. Anton holds a BS in biochemistry from the University of California, Berkeley, and a PhD in biochemistry from the University of Minnesota."}, {"name": "Avery Kramer", "description": " Avery Kramer is Cellana’s Director, Engineering & Downstream Processing. He has served in a variety of capacities at Cellana since 2007 with increasing levels of responsibility, including as Operations Manager, and has overseen health, safety, and environmental (HSE) areas as well as quality assurance (QA). Most recently Avery was Manager of Business Development. Prior to Cellana, he worked in the biopharmaceutical industry in the San Francisco Bay area in business development, project management, and quality assurance roles. Mr. Kramer has a B.S. in Chemical Engineering from the University of California at Berkeley, where he was the inaugural exchange student for the National Science Foundation’s Marine Bioproducts Engineering Center (MARBEC)."}, {"name": "Jeffrey G. Black", "description": " Mr. Black has more than 20 years in financial management and advisory roles and has served in senior-level finance roles for six publicly-traded companies. Mr. Black currently serves as the Chief Financial Officer of AltheaDx, a company that offers a full suite of services focused on molecular biomarker discover, assay development, assay validation and prospective/retrospective clinical trial testing in support of companion diagnostic development and commercialization. Prior to joining AltheaDx, Mr. Black served as Chief Financial Officer of Verenium Corporation, a Nasdaq-listed pioneer in the development and commercialization of high-performance enzymes for use in industrial processes. During his tenure at Verenium, Mr. Black has played a leadership role in nearly $400 million of strategic, equity, and debt financing transactions. Mr. Black’s prior experience includes serving as Executive Director of Accounting and Corporate Controller of Isis Pharmaceuticals, Inc. and Principal and Interim Financial Executive of Regent Pacific Management Corporation, a financial advisory firm through which he served as Vice President of Finance and Corporate Controller of Clarent Corporation and Vice President and Corporate Controller of Accelerated Networks, Inc. Mr. Black is a certified public accountant (inactive) and began his career with Ernst &amp; Young LLP. Mr. Black graduated with a bachelor’s degree in business from the University of Arizona."}]}