{"about": "Champion Energy Services is the fastest-growing retail electric provider in the nation and the largest never to have been affiliated with a utility. Champion Energy currently serves residential, governmental, commercial and industrial customers in deregulated electric energy markets in Texas, Illinois, Pennsylvania, Ohio, New Jersey, Maryland, Massachusetts and New York.\n\nEvery decision at every level is focused on creating greater value for our loyal customers. From exceptionally competitive electricity rates, to no hidden rates and straightforward monthly electric bills, to ensuring that live customer care is available around the clock every day of the year — and the list goes on — Champion Energy is ever-mindful of our purpose: to power lives and power businesses. Our experienced team manages commodity risks conservatively, balancing power supply with sales to minimize significant risk of loss.\n\nAlthough there are plenty of other electric service providers in the marketplace, Houston-based Champion Energy has risen to the top by keeping a sharp focus on customers' interests.\n\nSure, we know that competitive electricity prices are important to you, and we also know that you need us when you need us. That's why we're here 24/7 and on our toes all day, every day.", "name": "Champion Energy Services | Retail Electricity Provider | Lower Energy Prices", "members": [{"name": "Manage Account", "description": " David J. Tudor leads Champion Energy as President and Chief Executive Officer, with over 30 years of experience in the energy industry. During his career, he has been involved in the management of energy assets and trading. Prior to joining Champion Energy, David served as President and Chief Executive Officer of ACES, headquartered in Carmel, IN where he led the company's growth into a national energy risk management and trading company. Prior to ACES, David formed and served as President of Risk Advisors, LLC, which provided risk management advice to several large investor-owned utilities in the development and implementation of their risk management software systems and trading control policies. Prior to forming Risk Advisors, LLC, David served as Executive Vice President and Chief Operating Officer of PG&E Energy Trading. David currently serves as a Director of the general partner of Western Gas Partners, LP (NYSE: WES) and  Western Gas Equity Partners, LP (NYSE: WGP) and is Chairman of the audit committee of both.  David holds a Bachelor of Science degree in Accounting from David Lipscomb University in Nashville, Tennessee. Mike Slaughter, Champion Energy's Chief Financial Officer, is an experienced executive with a finance and accounting background in various public and private companies, public accounting, initial and secondary public offerings, acquisitions and other capital markets transactions. In addition to accounting, financial reporting and treasury, Mike also oversees human resources and legal issues. Mike joined Champion Energy when the company was acquired in 2008 as a portfolio company of Crane Capital Group, where he was involved in investments and acquisitions. Earlier in his career, Mike held various key financial positions, most recently as Principal Financial Officer and Chief Accounting Officer, at Eagle Global Logistics (NASDAQ: EAGL), a leading provider of global transportation and logistics services in more than 100 countries. Also founded by James R. \"Jim\" Crane, Eagle was sold to Apollo Management in a leveraged buy-out transaction valued at $2.2 billion. A certified public accountant with a Bachelor of Business Administration from the University of Texas, Mike's career began at Price Waterhouse, where he held various positions, most recently as senior auditor for public and private entities in the services, manufacturing, financial services and construction sectors. As Vice President – Market Development and Regulatory Affairs, Brenda Crockett spearheads key issues associated with Champion Energy's expansion into new deregulated markets and regulatory matters.  As part of Champion's original leadership team, beginning in 2005, she served as the company's Director of Retail Operations and subsequently Vice President of Wholesale Supply. Brenda brings over 25 years of energy industry experience, holding numerous positions at both Enron Corp and NGC Corp./Dynegy Inc. She has worked in a range of capacities: accounting, gas scheduling, transportation marketing and natural gas trading, including Dynegy's Senior Director of West Natural Gas Trading. In Brenda's most recent role at Dynegy, she was Senior Director of Retail Operations for Dynegy Energy Services, responsible for customer enrollment, customer service and billing system development.  Brenda holds a Bachelor of Business Administration degree in Accounting from Texas A&M University."}, {"name": "Pay Bill", "description": " Mike Slaughter, Champion Energy's Chief Financial Officer, is an experienced executive with a finance and accounting background in various public and private companies, public accounting, initial and secondary public offerings, acquisitions and other capital markets transactions. In addition to accounting, financial reporting and treasury, Mike also oversees human resources and legal issues. Mike joined Champion Energy when the company was acquired in 2008 as a portfolio company of Crane Capital Group, where he was involved in investments and acquisitions. Earlier in his career, Mike held various key financial positions, most recently as Principal Financial Officer and Chief Accounting Officer, at Eagle Global Logistics (NASDAQ: EAGL), a leading provider of global transportation and logistics services in more than 100 countries. Also founded by James R. \"Jim\" Crane, Eagle was sold to Apollo Management in a leveraged buy-out transaction valued at $2.2 billion. A certified public accountant with a Bachelor of Business Administration from the University of Texas, Mike's career began at Price Waterhouse, where he held various positions, most recently as senior auditor for public and private entities in the services, manufacturing, financial services and construction sectors. As Vice President – Market Development and Regulatory Affairs, Brenda Crockett spearheads key issues associated with Champion Energy's expansion into new deregulated markets and regulatory matters.  As part of Champion's original leadership team, beginning in 2005, she served as the company's Director of Retail Operations and subsequently Vice President of Wholesale Supply. Brenda brings over 25 years of energy industry experience, holding numerous positions at both Enron Corp and NGC Corp./Dynegy Inc. She has worked in a range of capacities: accounting, gas scheduling, transportation marketing and natural gas trading, including Dynegy's Senior Director of West Natural Gas Trading. In Brenda's most recent role at Dynegy, she was Senior Director of Retail Operations for Dynegy Energy Services, responsible for customer enrollment, customer service and billing system development.  Brenda holds a Bachelor of Business Administration degree in Accounting from Texas A&M University. As Vice President of Customer Operations, Alon Erlichman oversees Champion Energy's enrollments, billing, collections, and customer care functions across all markets.  He is also responsible for application development and infrastructure to support Champion Energy's business.  Prior to joining Champion Energy, he held several roles at Reliant Energy, including market settlements, billing and transaction management for 2 million residential and business customers.  Alon's career began at Arthur Andersen in the Business Consulting practice after he earned a Bachelor of Business Administration in Marketing from the Business Honors Program at the University of Texas in Austin."}, {"name": "Follow Us:", "description": ""}, {"name": "David J. Tudor", "description": " David J. Tudor leads Champion Energy as President and Chief Executive Officer, with over 30 years of experience in the energy industry. During his career, he has been involved in the management of energy assets and trading. Prior to joining Champion Energy, David served as President and Chief Executive Officer of ACES, headquartered in Carmel, IN where he led the company's growth into a national energy risk management and trading company. Prior to ACES, David formed and served as President of Risk Advisors, LLC, which provided risk management advice to several large investor-owned utilities in the development and implementation of their risk management software systems and trading control policies. Prior to forming Risk Advisors, LLC, David served as Executive Vice President and Chief Operating Officer of PG&E Energy Trading. David currently serves as a Director of the general partner of Western Gas Partners, LP (NYSE: WES) and  Western Gas Equity Partners, LP (NYSE: WGP) and is Chairman of the audit committee of both.  David holds a Bachelor of Science degree in Accounting from David Lipscomb University in Nashville, Tennessee."}, {"name": "Michael Sullivan", "description": " Michael Sullivan serves as Senior Vice President and Chief Operating Officer, with responsibility for all aspects of the company's day-to-day operations, including commercial and residential sales, wholesale supply, risk management, customer operations and customer care. Prior to joining Champion Energy, Michael was a founding partner of Ambridge Energy, LLC, which merged with Champion Energy in June 2008. Prior to founding Ambridge, he held several roles at Reliant Energy, including front and back office operations, sales and marketing support, and forecasting. Michael's career began at Accenture.  He earned a Bachelor of Science in finance from the University of South Alabama and a Master of Business Administration from Baylor University."}, {"name": "Michael Slaughter", "description": " Mike Slaughter, Champion Energy's Chief Financial Officer, is an experienced executive with a finance and accounting background in various public and private companies, public accounting, initial and secondary public offerings, acquisitions and other capital markets transactions. In addition to accounting, financial reporting and treasury, Mike also oversees human resources and legal issues. Mike joined Champion Energy when the company was acquired in 2008 as a portfolio company of Crane Capital Group, where he was involved in investments and acquisitions. Earlier in his career, Mike held various key financial positions, most recently as Principal Financial Officer and Chief Accounting Officer, at Eagle Global Logistics (NASDAQ: EAGL), a leading provider of global transportation and logistics services in more than 100 countries. Also founded by James R. \"Jim\" Crane, Eagle was sold to Apollo Management in a leveraged buy-out transaction valued at $2.2 billion. A certified public accountant with a Bachelor of Business Administration from the University of Texas, Mike's career began at Price Waterhouse, where he held various positions, most recently as senior auditor for public and private entities in the services, manufacturing, financial services and construction sectors."}, {"name": "Brian Tamplen", "description": " Brian Tamplen serves as Senior Vice President – Supply and Risk Management and leads all supply and risk management related functions for Champion Energy. Brian served previously as Head of Trading for GDF Suez North America and Vice President of Commercial Operations and Asset Management for Dynegy. In addition, he has a proven history in asset and risk management with Pacific Gas and Electric, Detroit Edison, and Atmos Energy.  Brian holds a Bachelor of Science in Mathematics from The University of Texas at Tyler and a Masters of Business Administration from The University of Massachusetts."}, {"name": "David Coffman", "description": " David Coffman serves as Vice President of Sales and Marketing, with responsibility for sales and marketing related functions in all markets served by Champion Energy. He leads Champion Energy's customer acquisition and market development strategies for current and future markets. Prior to joining the company, David served as Vice President of Marketing for GDF SUEZ Energy Resources responsible for strategic marketing, sales development, new market expansions and product development. David was a Managing Director for Aquila Energy with retail and wholesale energy origination responsibilities, he also held roles at Black & Veatch responsible for sales and commodity risk management consulting engagements. David earned a Bachelor of Science in Business Administration from the University of Missouri and has his Masters of Business Administration from Avila University."}, {"name": "Brenda Crockett", "description": " As Vice President – Market Development and Regulatory Affairs, Brenda Crockett spearheads key issues associated with Champion Energy's expansion into new deregulated markets and regulatory matters.  As part of Champion's original leadership team, beginning in 2005, she served as the company's Director of Retail Operations and subsequently Vice President of Wholesale Supply. Brenda brings over 25 years of energy industry experience, holding numerous positions at both Enron Corp and NGC Corp./Dynegy Inc. She has worked in a range of capacities: accounting, gas scheduling, transportation marketing and natural gas trading, including Dynegy's Senior Director of West Natural Gas Trading. In Brenda's most recent role at Dynegy, she was Senior Director of Retail Operations for Dynegy Energy Services, responsible for customer enrollment, customer service and billing system development.  Brenda holds a Bachelor of Business Administration degree in Accounting from Texas A&M University."}, {"name": "Alon Erlichman", "description": " As Vice President of Customer Operations, Alon Erlichman oversees Champion Energy's enrollments, billing, collections, and customer care functions across all markets.  He is also responsible for application development and infrastructure to support Champion Energy's business.  Prior to joining Champion Energy, he held several roles at Reliant Energy, including market settlements, billing and transaction management for 2 million residential and business customers.  Alon's career began at Arthur Andersen in the Business Consulting practice after he earned a Bachelor of Business Administration in Marketing from the Business Honors Program at the University of Texas in Austin."}, {"name": "Jason Fox", "description": " Jason Fox serves as Vice President of Pricing and Supply, responsible for Champion Energy's pricing and risk support functions across all markets, with over 10 years of experience in the energy industry. He also contributes to the expansion into new deregulated electricity and natural gas markets.  Jason was part of Champion's original team, beginning in 2005, and previously served as Senior Regional Director developing indirect commercial and industrial sales across PJM and managing supply and forecasting for IL and PA.  Prior to joining Champion Energy, he worked at Centerpoint Energy in the rate department responsible for setting natural gas rates for over 3 million residential and business customers across 6 states.  Jason earned a Bachelor of Business Administration in Finance from the School of Business at the University of Texas at Austin. "}, {"name": "Jeffrey S. Young", "description": " Jeff Young serves as Vice President Information Technology and Controls and leads Champion Energy's IT team that provides system infrastructure and administration, system design and development, and business process optimization. Jeff has over 23 years of experience in the energy industry with a focus on energy trading, asset optimization, enterprise risk management, compliance, credit, and energy trading system implementations. Jeff comes to Champion from Utility Management Corporation (UMC), an energy management company offering risk and procurement consulting services to industry and government entities. Prior to joining UMC, Jeff was a Partner in the energy practice of PA Consulting Group, Inc., a global management consulting organization based in the UK with a broad focus in energy, IT and telecom. Jeff also held management positions in two other leading gas and power marketing organizations, most recently as Sr. Vice President of Trading and Risk Management for PG&E Energy Trading Corp., where he was responsible for the US wholesale natural gas trading division.  He became a Member of the New York Mercantile Exchange between 1996 and 1999 serving on the settlement and natural gas options committees. In addition to his industry experience, Jeff has performed consulting services on numerous energy industry litigation assignments and has testified as an expert witness on a range of energy trading and portfolio valuation issues. "}, {"name": "John Ballenger", "description": " As Director of New Business Development, John Ballenger leads activities related to Champion Energy's corporate strategic planning, mergers and acquisitions, alliances, venture investments and new business activities.  John came to Champion in 2009 as Back Office Manager, and has grown through multiple roles within the organization, including Director of Operations, Director of Residential Acquisitions and Regional Sales Director.  Prior to Champion Energy, John has experience in retail management with Target, advertising sales with Consolidated Communications and SBC, and church ministry.  John earned his Master of Business Administration from the University of Texas in 2009 and his Bachelor of Arts in Communications from Texas A&M University in 1998."}, {"name": "Rebecca Bridges", "description": " Rebecca Bridges oversees Champion Energy's residential marketing. Rebecca has worked in the deregulated electricity and natural gas markets for over ten years, managing customer acquisition and retention programs at Reliant Energy, Direct Energy and Commerce Energy prior to joining Champion Energy in 2010. Prior to her work in the energy industry, Rebecca oversaw marketing communications for Continental Airlines' OnePass loyalty marketing program, and developed customer retention programs at HP. Rebecca holds an MBA from Rice University and a BBA in marketing from the University of Massachusetts at Amherst."}, {"name": "My Account", "description": " David J. Tudor leads Champion Energy as President and Chief Executive Officer, with over 30 years of experience in the energy industry. During his career, he has been involved in the management of energy assets and trading. Prior to joining Champion Energy, David served as President and Chief Executive Officer of ACES, headquartered in Carmel, IN where he led the company's growth into a national energy risk management and trading company. Prior to ACES, David formed and served as President of Risk Advisors, LLC, which provided risk management advice to several large investor-owned utilities in the development and implementation of their risk management software systems and trading control policies. Prior to forming Risk Advisors, LLC, David served as Executive Vice President and Chief Operating Officer of PG&E Energy Trading. David currently serves as a Director of the general partner of Western Gas Partners, LP (NYSE: WES) and  Western Gas Equity Partners, LP (NYSE: WGP) and is Chairman of the audit committee of both.  David holds a Bachelor of Science degree in Accounting from David Lipscomb University in Nashville, Tennessee. Mike Slaughter, Champion Energy's Chief Financial Officer, is an experienced executive with a finance and accounting background in various public and private companies, public accounting, initial and secondary public offerings, acquisitions and other capital markets transactions. In addition to accounting, financial reporting and treasury, Mike also oversees human resources and legal issues. Mike joined Champion Energy when the company was acquired in 2008 as a portfolio company of Crane Capital Group, where he was involved in investments and acquisitions. Earlier in his career, Mike held various key financial positions, most recently as Principal Financial Officer and Chief Accounting Officer, at Eagle Global Logistics (NASDAQ: EAGL), a leading provider of global transportation and logistics services in more than 100 countries. Also founded by James R. \"Jim\" Crane, Eagle was sold to Apollo Management in a leveraged buy-out transaction valued at $2.2 billion. A certified public accountant with a Bachelor of Business Administration from the University of Texas, Mike's career began at Price Waterhouse, where he held various positions, most recently as senior auditor for public and private entities in the services, manufacturing, financial services and construction sectors. As Vice President – Market Development and Regulatory Affairs, Brenda Crockett spearheads key issues associated with Champion Energy's expansion into new deregulated markets and regulatory matters.  As part of Champion's original leadership team, beginning in 2005, she served as the company's Director of Retail Operations and subsequently Vice President of Wholesale Supply. Brenda brings over 25 years of energy industry experience, holding numerous positions at both Enron Corp and NGC Corp./Dynegy Inc. She has worked in a range of capacities: accounting, gas scheduling, transportation marketing and natural gas trading, including Dynegy's Senior Director of West Natural Gas Trading. In Brenda's most recent role at Dynegy, she was Senior Director of Retail Operations for Dynegy Energy Services, responsible for customer enrollment, customer service and billing system development.  Brenda holds a Bachelor of Business Administration degree in Accounting from Texas A&M University."}, {"name": "Customer Care", "description": " David J. Tudor leads Champion Energy as President and Chief Executive Officer, with over 30 years of experience in the energy industry. During his career, he has been involved in the management of energy assets and trading. Prior to joining Champion Energy, David served as President and Chief Executive Officer of ACES, headquartered in Carmel, IN where he led the company's growth into a national energy risk management and trading company. Prior to ACES, David formed and served as President of Risk Advisors, LLC, which provided risk management advice to several large investor-owned utilities in the development and implementation of their risk management software systems and trading control policies. Prior to forming Risk Advisors, LLC, David served as Executive Vice President and Chief Operating Officer of PG&E Energy Trading. David currently serves as a Director of the general partner of Western Gas Partners, LP (NYSE: WES) and  Western Gas Equity Partners, LP (NYSE: WGP) and is Chairman of the audit committee of both.  David holds a Bachelor of Science degree in Accounting from David Lipscomb University in Nashville, Tennessee. Michael Sullivan serves as Senior Vice President and Chief Operating Officer, with responsibility for all aspects of the company's day-to-day operations, including commercial and residential sales, wholesale supply, risk management, customer operations and customer care. Prior to joining Champion Energy, Michael was a founding partner of Ambridge Energy, LLC, which merged with Champion Energy in June 2008. Prior to founding Ambridge, he held several roles at Reliant Energy, including front and back office operations, sales and marketing support, and forecasting. Michael's career began at Accenture.  He earned a Bachelor of Science in finance from the University of South Alabama and a Master of Business Administration from Baylor University. Mike Slaughter, Champion Energy's Chief Financial Officer, is an experienced executive with a finance and accounting background in various public and private companies, public accounting, initial and secondary public offerings, acquisitions and other capital markets transactions. In addition to accounting, financial reporting and treasury, Mike also oversees human resources and legal issues. Mike joined Champion Energy when the company was acquired in 2008 as a portfolio company of Crane Capital Group, where he was involved in investments and acquisitions. Earlier in his career, Mike held various key financial positions, most recently as Principal Financial Officer and Chief Accounting Officer, at Eagle Global Logistics (NASDAQ: EAGL), a leading provider of global transportation and logistics services in more than 100 countries. Also founded by James R. \"Jim\" Crane, Eagle was sold to Apollo Management in a leveraged buy-out transaction valued at $2.2 billion. A certified public accountant with a Bachelor of Business Administration from the University of Texas, Mike's career began at Price Waterhouse, where he held various positions, most recently as senior auditor for public and private entities in the services, manufacturing, financial services and construction sectors. As Vice President of Customer Operations, Alon Erlichman oversees Champion Energy's enrollments, billing, collections, and customer care functions across all markets.  He is also responsible for application development and infrastructure to support Champion Energy's business.  Prior to joining Champion Energy, he held several roles at Reliant Energy, including market settlements, billing and transaction management for 2 million residential and business customers.  Alon's career began at Arthur Andersen in the Business Consulting practice after he earned a Bachelor of Business Administration in Marketing from the Business Honors Program at the University of Texas in Austin."}]}