{"about": "NGVAmerica is a national organization dedicated to the development of a growing, profitable, and sustainable market for vehicles powered by natural gas or biomethane. NGVAmerica represents more than 230 companies, environmental groups, and government organizations interested in the promotion and use of natural gas and biomethane as transportation fuels. Our member companies are those that produce, distribute, and market natural gas and biomethane across the country; manufacture and service natural gas vehicles, engines, and equipment; and operate fleets powered by clean-burning gaseous fuels.\n\nOur Objective:\n\n To create a profitable, sustainable and growing market for compressed natural gas (CNG) and liquefied natural gas (LNG)-powered vehicles.\n\nOur Mission:\n\n To provide clear value to membership as the national voice driving increasing commercialization of CNG and LNG as economic, clean, domestic, safe and abundant fuels for vehicles by:", "name": "Natural Gas Vehicles for America", "members": {"1": {"name": "James A. Doyle,", "description": ""}, "2": {"name": "Fred Hildebrandt,", "description": " Fred Hildebrandt,  \n          Executive VP, Co-inventor, Director.  B.Sc. Chemical Engineering, \n          University of Alberta.  Retired from Federation Chemicals Limited, a \n          wholly owned subsidiary of W.R. Grace & Company.  Served as President \n          and General Manager of W.R. Grace's chemical complex in Trinidad, West \n          Indies.  Experienced in management and operations of ammonia, \n          hydrogen and other complex chemical plants in Canada and Trinidad.  Experience \n          in the design, construction, operation and management of several hydrogen-based \n          plants."}, "3": {"name": "Anthony M. Howarth,", "description": " Anthony M. Howarth,  \n          Vice President, Director.  MS Engineering Administration, Virginia PolyTech, BS, Industrial \n          Engineering, Trenton State College.  Over twenty years experience in \n          operations management, Mr. Howarth's expertise range from Supply Chain \n          and technology management, financial analysis and management consulting.\n\t    His experience includes senior management positions, most \n          recently with Lucent Technologies-Bell Laboratories, Carl Zeiss, Price Waterhouse, \n           Sara Lee Corporation, and Coopers & Lybrand."}, "4": {"name": "William Poist,  ", "description": " William Poist,  Vice President, Director.  \n          BA Ohio Wesleyan University, MS Taxation. President, MCP, Inc.  Forty \n          years experience in tax, business, and financial consulting.  He is also \n          a registered investment advisor, an outside mutual fund director, and \n          a Certified Public Accountant."}, "5": {"name": "Lawrence J. McEvoy", "description": " Lawrence J. McEvoy,  \n          Consulting Engineer.  BS, Mechanical Engineering, Notre Dame.  Experience \n          includes 24 years at Foster Wheeler as Executive VP and General Manager \n          of Fired Heater Division and almost ten years in engineering with MW \n          Kellogg Company.  Extensive background in sales, project, design, purchasing \n          and cost control areas, as well in international operations."}, "6": {"name": "Peter Davies", "description": " Peter Davies,  Consulting Minerals Engineer.  \n          Retired Chief Mining Engineer for Bechtel Corporation.  Worldwide experience in mining \n          and beneficiation including mines in northern British Columbia and Alberta."}, "7": {"name": "Gregory J. Porges,", "description": " Gregory J. Porges,   \n          Corporate Counsel.  B.S.C. St. John's University and Spring Hill College, \n          J.D. Fordham University.  Managing partner, Porges Hamlin Knowles & Prouty, PA.\n\t    Over forty years experience in banking, corporation \n          and business law, including mergers and acquisitions."}, "8": {"name": "William A. Lloyd,", "description": " William A. Lloyd,  \n          Chief Engineer.  Mechanical Engineer with 17 years experience at Syncrude \n          in Ft. McMurray in extraction \n          and upgrading technologies.  Had broad experience in maintenance and engineering at W.R. \n          Grace's Trinidad operations including world-class ammonia, hydrogen, \n          urea and other chemical operations."}, "9": {"name": "Robert Lamontagne,", "description": " Robert Lamontagne,  Chemical \n          Process Engineer.  Experienced process engineer and in computer software \n          design.  Most recently worked with AOC as \n          corporate Technical Data Systems Leader responsible for integrating \n          manufacturing and business systems within AOC's five North American \n          unsaturated polyester facilities."}, "10": {"name": "Al Vondrasek,", "description": " Al Vondrasek,  Consulting \n          Geologist and Minerals Engineer.  Lakeland, Florida.  Broad experience in managing large \n          phosphate mining and chemical operations in central Florida with W.R. \n          Grace & Company.  Assisted Chattanooga in evaluation of oil sands \n          and shale deposits in Canada and U.S."}, "11": {"name": "Brian Zweig,", "description": " Brian Zweig,  Consultant.   \n          B.S., Cornell University, MBA, Dartmouth College.  Principal, Business \n          Opportunities Management Consulting, focuses on helping early \n          stage and high growth companies develop business plans and attract investment \n          capital."}}}