{"about": "Accessing pages and materials on this website constitutes your agreement to the Terms and Conditions of Use , most recently updated October 17, 2014.", "name": "National Oilwell Varco", "members": [{"name": "En Español ", "description": " Our leadership team created, hones, and maintains our company's focus and commitment, and this continues to drive our growth and success. At the same time, we take great care to integrate our Direct Energy values into everything we do. As one of North America's leading integrated energy providers, we have an equal responsibility to all of our stakeholders and the communities in which we are located. Learn more about the dynamic men and women leading the way for Direct Energy in North America. Badar Khan is the President & CEO of Direct Energy, with overall responsibility for the company's operations in North America.  As CEO, he is leading our vision to leverage technology to fundamentally transform the way homes and businesses engage in and use energy. Badar's extensive experience in energy spans retail power and gas and energy-related services, to wholesale energy trading, to upstream power generation and oil & gas exploration and production.  He has been a leader in the restructuring of the retail and wholesale power markets in both the US and the UK.  Badar was appointed CEO in April 2013.  He has served in multiple leadership roles at Direct Energy and its parent company, Centrica, including Senior Vice President - US North; Managing Director - British Gas Business; and President – Upstream & Trading.  Previously, he was a senior officer of a start-up private retail energy company in the US, and prior to that worked in management consulting with Deloitte Consulting in Boston and KPMG London. Badar currently serves on the Board of Directors of the Greater Houston Partnership, the University of Houston Energy Advisory Board, and on the Houston Advisory Council of the Tahirih Justice Center.  He also serves on the executive council of TechNet, a group of leading technology CEOs advocating for the innovation economy.  Badar holds a degree in engineering from London, and an MBA from the Wharton School.  Badar, and his wife, Masu, live in Houston with their three children. As Chief Financial Officer (CFO) for Direct Energy, Andrew Sunderman has responsibility for leadership of the DE Finance strategy and agenda including delivery of overall DE performance goals and partnering with the various lines of business to ensure their financial success. Andrew joined Direct Energy in June 2012, after serving as Managing Director, Finance and Business Management and Market Risk for JP Morgan, a leading worldwide financial services firm. Prior to JP Morgan, Andrew held senior financial leadership roles at several major energy and energy services companies, including positions in Upstream and Trading. He has significant experience in risk management, holding the position of Chief Risk Officer in several organizations and has substantial experience in mergers and acquisitions. Andrew also spent three years with British Gas where he was Chief International Accountant for British Gas Exploration and Production based in Gabon, West Africa. Andrew holds an undergraduate degree in Accounting from Lamar University. He currently resides in Cypress, TX, with his wife of 28 years and two of his five children. Paul Dobson serves as Chief Operations Officer for Direct Energy and is charged with efficiently transforming the company's customer experience. His team includes billing, collections, IT, contact centers and the management of procurement, facilities and real estate. Since joining DE in 2003, Paul has worked in several business units in Finance and Operations, including Senior Vice President of Finance for Direct Energy Business, Vice President of Finance for Canada East and CFO of British Gas Business. Before becoming COO, he was responsible for delivering an industry-leading customer experience in North America as Head of Customer Operations for Direct Energy Business. Prior to Direct Energy, Paul worked at CIBC for 10 years in various financial and operational roles, including VP & CFO of CIBC National Bank, a U.S. retail bank. Paul earned an Honors BA from the University of Waterloo, an MBA from the University of Western Ontario and is a CPA and CMA. He has served on the boards of several organizations including The Winchester Thurston School and the Pittsburgh Ballet Theatre. Paul resides in Houston with his wife Linda, their two teenage boys, Michael and Eric, and dog Cara. His pastimes include golfing, fishing, boating and playing ice hockey.\n Manu Asthana became President of Direct Energy Residential effective November 1, 2013. Formerly, Manu was Head of Direct Energy Upstream & Trading and prior to this he was the Senior Vice President responsible for the continued formation and growth of the Direct Energy Midstream and Trading line of business. As President of Direct Energy Residential, Manu is responsible for leading Direct Energy's residential retail energy activities throughout North America.  Formerly, Manu was Head of Direct Energy Upstream & Trading and had responsibility for operations at Direct Energy's power generation units, procurement of energy, capacity and ancillary services for Direct Energy's retail businesses and continued growth of Direct Energy's Midstream & Trading line of business.  Manu is a member of the Direct Energy Management Team, the Centrica Group Financial Risk Management Committee and the Centrica Senior Leadership Team. Before joining Direct Energy, Manu was responsible for trading, retail portfolio management for TXU Energy and generation asset management for Luminant Energy's 14,000 MW fleet of generation assets in Texas.  Prior to this, he served in several leadership capacities for the TXU group of companies, including as Chief Risk Officer for TXU Corporation.  Manu is a graduate of the Leadership Dallas program, class of 2003 and previously served on the associate board of the Cox MBA program at Southern Methodist University. Manu holds a bachelor's degree in economics with concentrations in finance and entrepreneurial management from the Wharton School at the University of Pennsylvania, where he was designated both a Joseph Wharton Scholar and a Benjamin Franklin Scholar.  Manu and his wife, Aparna, have two children and live in Houston. John is currently President of Direct Energy Business. In this role, he is responsible for our North American commercial, industrial and wholesale customer business. His main area of focus for 2014 is the ongoing integration and growth of the legacy businesses comprised of Hess Energy Marketing (HEM), DEB and DEU. John joined DEB as Head of the East region in November 2013, and prior to that he was Vice President of Sales and Operations for Hess Corporation's Energy Marketing business. He has twenty years of industry experience in a variety of roles including sales, marketing, natural gas and electric supply & trading, M&A and power plant development. He previously served as an Executive Committee Member of the Bayonne Energy Center and Newark Energy Center, two NJ based power plants. John began his career in Alexandria, VA at the Eastern Group and subsequently worked for Statoil Energy, Inc., where he was responsible for their natural gas and electric supply operations. John has a B.S in Agricultural Economics from Penn State University and has attended executive development programs at the Fuqua School of Business at Duke University and Harvard Business School. John lives in Westfield, NJ with his wife Suzy and their children Regan and Nathan. Scott Boose is the President of Direct Energy Services (DES), a pan North American home services business that employs 3,723 and services over 3.1 million customer relationships each year across 47 states and 10 Canadian provinces. Prior to this role, Scott was the President of DES Clockwork Home Services business which operates its franchise network in 44 states and has company-owned operations in 11 states and two Canadian provinces. Scott joined Direct Energy in 2004 through the acquisition of Airtron (formerly Residential Services Group). In his ten years with Airtron, Scott held increasingly senior positions with the organization, including the role of Senior Vice President of Operations – HVAC. Scott also served as the Managing Director of the Heating Services business for British Gas, an operating unit of Centrica. In this role, Scott oversaw a team of 11,000 people including 8,000 frontline engineers and installers. Scott has a B.S. in Business, Accounting and Finance from Wright State University and graduated with Honors. Scott is married and resides in Sarasota, Florida, with his wife and two children. As Executive Vice President  for Legal, G&RA, Compliance and External Affairs, Carol is responsible for all aspects of Direct Energy's legal, government regulatory and compliance functions in North America, as well as for the external communications function. Carol has over 25 years of experience in the energy industry. Prior to joining Direct Energy, Carol held several executive roles in the industry, including Executive Vice President and General Counsel of Dynegy Inc., Senior Vice President and General Counsel of Duke Energy International, the international merchant energy business of the Duke Energy Corporation, and Deputy General Counsel of PNM Resources, Inc. Before that time, Carol was an attorney with Conoco Inc., in Houston and London, holding positions of increasing responsibility and working to support virtually all aspects of the upstream oil and gas business. Additionally, Carol served as the Executive Vice President and General Counsel of H&R Block, Inc., the world's largest tax services provider, and a leading provider of financial, and business consulting services. Carol received her law degree from the American University and a bachelor's degree in International Relations from Dickinson College in Carlisle, PA. She is a member of the bar in the states of Texas, New Mexico, and Missouri and the Commonwealth of Pennsylvania. She is a member of the Board of Trustees of the Sandia Foundation in Albuquerque, New Mexico. Melinda Guerra-Reeves is the Executive Vice President (EVP) for Direct Energy and is responsible for leading the organization's people agenda. She joined Direct Energy in March 2013 and brings more than 22 years of Human Resources (HR) experience in financial services, insurance and high tech industries. Melinda's experience crosses multiple HR disciplines with deep technical expertise in employee relations, talent acquisition, organizational transformations, talent development and culture. Prior to joining Direct Energy, Melinda spent more than 12 years with United Services Automobile Association (USAA), an integrated financial services firm, where she last served as the EVP, People Services, with responsibility for managing the people agenda for more than 24,000 employees. Prior to USAA, Melinda held key HR leadership positions with Compaq Computer Corporation and American General Life Insurance. Melinda holds a Bachelor's degree in Journalism from the University of Texas at Austin and is a certified Senior Professional, Human Resources (SPHR). Melinda and her husband, Skip, have three children and reside in Houston."}, {"name": "Direct Energy", "description": " Our leadership team created, hones, and maintains our company's focus and commitment, and this continues to drive our growth and success. At the same time, we take great care to integrate our Direct Energy values into everything we do. As one of North America's leading integrated energy providers, we have an equal responsibility to all of our stakeholders and the communities in which we are located. Learn more about the dynamic men and women leading the way for Direct Energy in North America. Badar Khan is the President & CEO of Direct Energy, with overall responsibility for the company's operations in North America.  As CEO, he is leading our vision to leverage technology to fundamentally transform the way homes and businesses engage in and use energy. Badar's extensive experience in energy spans retail power and gas and energy-related services, to wholesale energy trading, to upstream power generation and oil & gas exploration and production.  He has been a leader in the restructuring of the retail and wholesale power markets in both the US and the UK.  Badar was appointed CEO in April 2013.  He has served in multiple leadership roles at Direct Energy and its parent company, Centrica, including Senior Vice President - US North; Managing Director - British Gas Business; and President – Upstream & Trading.  Previously, he was a senior officer of a start-up private retail energy company in the US, and prior to that worked in management consulting with Deloitte Consulting in Boston and KPMG London. Badar currently serves on the Board of Directors of the Greater Houston Partnership, the University of Houston Energy Advisory Board, and on the Houston Advisory Council of the Tahirih Justice Center.  He also serves on the executive council of TechNet, a group of leading technology CEOs advocating for the innovation economy.  Badar holds a degree in engineering from London, and an MBA from the Wharton School.  Badar, and his wife, Masu, live in Houston with their three children. As Chief Financial Officer (CFO) for Direct Energy, Andrew Sunderman has responsibility for leadership of the DE Finance strategy and agenda including delivery of overall DE performance goals and partnering with the various lines of business to ensure their financial success. Andrew joined Direct Energy in June 2012, after serving as Managing Director, Finance and Business Management and Market Risk for JP Morgan, a leading worldwide financial services firm. Prior to JP Morgan, Andrew held senior financial leadership roles at several major energy and energy services companies, including positions in Upstream and Trading. He has significant experience in risk management, holding the position of Chief Risk Officer in several organizations and has substantial experience in mergers and acquisitions. Andrew also spent three years with British Gas where he was Chief International Accountant for British Gas Exploration and Production based in Gabon, West Africa. Paul Dobson serves as Chief Operations Officer for Direct Energy and is charged with efficiently transforming the company's customer experience. His team includes billing, collections, IT, contact centers and the management of procurement, facilities and real estate. Since joining DE in 2003, Paul has worked in several business units in Finance and Operations, including Senior Vice President of Finance for Direct Energy Business, Vice President of Finance for Canada East and CFO of British Gas Business. Before becoming COO, he was responsible for delivering an industry-leading customer experience in North America as Head of Customer Operations for Direct Energy Business. Prior to Direct Energy, Paul worked at CIBC for 10 years in various financial and operational roles, including VP & CFO of CIBC National Bank, a U.S. retail bank. Paul earned an Honors BA from the University of Waterloo, an MBA from the University of Western Ontario and is a CPA and CMA. He has served on the boards of several organizations including The Winchester Thurston School and the Pittsburgh Ballet Theatre. Paul resides in Houston with his wife Linda, their two teenage boys, Michael and Eric, and dog Cara. His pastimes include golfing, fishing, boating and playing ice hockey.\n Manu Asthana became President of Direct Energy Residential effective November 1, 2013. Formerly, Manu was Head of Direct Energy Upstream & Trading and prior to this he was the Senior Vice President responsible for the continued formation and growth of the Direct Energy Midstream and Trading line of business. As President of Direct Energy Residential, Manu is responsible for leading Direct Energy's residential retail energy activities throughout North America.  Formerly, Manu was Head of Direct Energy Upstream & Trading and had responsibility for operations at Direct Energy's power generation units, procurement of energy, capacity and ancillary services for Direct Energy's retail businesses and continued growth of Direct Energy's Midstream & Trading line of business.  Manu is a member of the Direct Energy Management Team, the Centrica Group Financial Risk Management Committee and the Centrica Senior Leadership Team. Before joining Direct Energy, Manu was responsible for trading, retail portfolio management for TXU Energy and generation asset management for Luminant Energy's 14,000 MW fleet of generation assets in Texas.  Prior to this, he served in several leadership capacities for the TXU group of companies, including as Chief Risk Officer for TXU Corporation.  Manu is a graduate of the Leadership Dallas program, class of 2003 and previously served on the associate board of the Cox MBA program at Southern Methodist University. John is currently President of Direct Energy Business. In this role, he is responsible for our North American commercial, industrial and wholesale customer business. His main area of focus for 2014 is the ongoing integration and growth of the legacy businesses comprised of Hess Energy Marketing (HEM), DEB and DEU. John joined DEB as Head of the East region in November 2013, and prior to that he was Vice President of Sales and Operations for Hess Corporation's Energy Marketing business. He has twenty years of industry experience in a variety of roles including sales, marketing, natural gas and electric supply & trading, M&A and power plant development. He previously served as an Executive Committee Member of the Bayonne Energy Center and Newark Energy Center, two NJ based power plants. John began his career in Alexandria, VA at the Eastern Group and subsequently worked for Statoil Energy, Inc., where he was responsible for their natural gas and electric supply operations. Scott Boose is the President of Direct Energy Services (DES), a pan North American home services business that employs 3,723 and services over 3.1 million customer relationships each year across 47 states and 10 Canadian provinces. Scott joined Direct Energy in 2004 through the acquisition of Airtron (formerly Residential Services Group). In his ten years with Airtron, Scott held increasingly senior positions with the organization, including the role of Senior Vice President of Operations – HVAC. As Executive Vice President  for Legal, G&RA, Compliance and External Affairs, Carol is responsible for all aspects of Direct Energy's legal, government regulatory and compliance functions in North America, as well as for the external communications function. Carol has over 25 years of experience in the energy industry. Prior to joining Direct Energy, Carol held several executive roles in the industry, including Executive Vice President and General Counsel of Dynegy Inc., Senior Vice President and General Counsel of Duke Energy International, the international merchant energy business of the Duke Energy Corporation, and Deputy General Counsel of PNM Resources, Inc. Before that time, Carol was an attorney with Conoco Inc., in Houston and London, holding positions of increasing responsibility and working to support virtually all aspects of the upstream oil and gas business. Melinda Guerra-Reeves is the Executive Vice President (EVP) for Direct Energy and is responsible for leading the organization's people agenda. She joined Direct Energy in March 2013 and brings more than 22 years of Human Resources (HR) experience in financial services, insurance and high tech industries. Melinda's experience crosses multiple HR disciplines with deep technical expertise in employee relations, talent acquisition, organizational transformations, talent development and culture. Prior to joining Direct Energy, Melinda spent more than 12 years with United Services Automobile Association (USAA), an integrated financial services firm, where she last served as the EVP, People Services, with responsibility for managing the people agenda for more than 24,000 employees. Prior to USAA, Melinda held key HR leadership positions with Compaq Computer Corporation and American General Life Insurance."}, {"name": "Company Overview", "description": ""}, {"name": "Everyday Innovation", "description": " Badar currently serves on the Board of Directors of the Greater Houston Partnership, the University of Houston Energy Advisory Board, and on the Houston Advisory Council of the Tahirih Justice Center.  He also serves on the executive council of TechNet, a group of leading technology CEOs advocating for the innovation economy.  Badar holds a degree in engineering from London, and an MBA from the Wharton School.  Badar, and his wife, Masu, live in Houston with their three children."}, {"name": "Norton Secured", "description": ""}]}