{"about": "Accessing pages and materials on this website constitutes your agreement to the Terms and Conditions of Use , most recently updated October 17, 2014.", "name": "National Oilwell Varco", "members": [{"name": "John Van Scoter", "description": " John Van Scoter, Chief Executive Officer, is a seasoned leader in the advancement and implementation of global market strategies for emerging technologies. Throughout his 25-year career at Texas Instruments (TI), Mr. Van Scoter served as Senior Vice President responsible for the DLP® Products division growing the technology to a recognized ingredient brand in the HDTV, Projector, and Digital Cinema markets. He also served as TI’s Vice President for emerging DSP start-up businesses in MP3/Internet Audio and Printing markets, as well as in various product development, manufacturing, and sales capacities. Immediately prior to joining eSolar, Mr. Van Scoter developed TI’s Alternative Energy strategies for the smart grid/meter, solar, LED lighting, smart motor, and energy harvesting markets. Mr. Van Scoter obtained his BS degree in Mechanical Engineering from the University of Vermont and also serves on the Tyco Electronics (NYSE: TEL) Board of Directors."}, {"name": "Linda Heller", "description": " Linda C. Heller served as Chief Financial Officer, Senior Vice President, Finance and Treasurer of Power-One, Inc. from 2008 to 2010. She served as the Vice President of Investor Relations of Applied Materials, Inc. in 2008 and had responsibility for Applied’s relationships with investors, financial analysts and the broader financial community. During her tenure at Amgen (2004 – 2008), she served in the capacities of Vice President, Finance for the Operations Division and the Global R&D Division.  Prior to joining Amgen, Ms. Heller held positions at Johnson & Johnson, Pharmacia (acquired by Pfizer Inc.), Silicon Graphics and Salomon Brothers serving in finance, investor relations, marketing and M&A roles. Ms. Heller holds a Bachelor’s Degree in Economics from Rice University and Master’s Degree (M.S.) in Management from the Massachusetts Institute of Technology’s Sloan School of Management.  She has been a member of Tech Coast Angels, Central Coast Network, since 2011."}, {"name": "Dale Rogers", "description": " Dale Rogers leads the Projects team in the global pursuit and capture of commercial projects utilizing the eSolar technology and is also responsible for developing and managing key strategic relationships and partnerships. He previously served as eSolar’s SVP of International Markets and as SVP, Projects, and he brings over 30 years of experience in solar thermal and nuclear power systems product development and plant operations. Before joining eSolar in 2007, Mr. Rogers was responsible for strategic planning and business development for Solar Programs at Rocketdyne Propulsion and Power. He first became involved in concentrated solar power (CSP) systems at Rocketdyne during the mid-1990s, where he led the initial efforts to commercialize the Solar 2-based power tower technology. Mr. Rogers has continued to actively promote the global commercialization of CSP technologies through several solar organizations, including serving as a U.S. representative to the SolarPACES Executive Committee. Mr. Rogers obtained his M. Eng. and BS degrees in Nuclear Engineering from Texas A&M University."}, {"name": "Rick Huibregtse ", "description": " Rick Huibregtse leads the Engineering team including mechanical and electrical development, reliability, analysis, along with software and systems teams. Mr. Huibregtse is a technical leader with over 25 years of successful innovation, product development and operations experience in the transportation components and energy conversion industries. Mr. Huibregtse began his career with General Motors and its component division spinoffs, and has extensive global experience, including managing an engine controls plant startup in Portugal and leading European product and customer development at Delphi Automotive’s Luxembourg Tech Center. Prior to joining eSolar, he was VP of Engineering for Remy Inc. in the rotating electric component industry, and consulted in the ultracapacitor and hybrid propulsion industries in auto, truck and off-road markets. Mr. Huibregtse earned his BSME degree from Kettering University with a specialty in electrical and computer engineering. \n\t\t\t3355 W. Empire Avenue\nSuite 200, \nBurbank, CA 91504, USA \n877-ESOLAR7 (toll-free) \n818-303-9500 (tel) \n818-303-9501 (fax) Business Development / Sales Inquiries\nPlease contact: info@esolar.com"}, {"name": "Nathan Lowstuter", "description": " Nathan Lowstuter leads the Supply Chain management function, including strategic sourcing, contract manufacturing, logistics, and supplier quality.  Mr. Lowstuter has extensive global Supply Chain leadership and New Product Development sourcing experience from Dover Corporation, Honeywell, Boeing, and FedEx.  Prior to joining eSolar, he was the VP of Global Supply Chain for one of Dover Corporation’s operating companies (Anthony International) that had 6 manufacturing sites across North America, Europe, and Asia.  Mr. Lowstuter earned his MBA from the University of Southern California."}, {"name": "Craig Tyner", "description": " Dr. Craig Tyner is one of the world’s leading experts in solar technologies. During his 31-year tenure at Sandia National Laboratories, Dr. Tyner oversaw the solar and geothermal R&D programs, and most recently served as manager of the Licensing and Intellectual Property Management Department. Dr. Tyner participated in the testing and analysis of the Solar One Project – the first solar power tower system ever built – and was program manager for all Sandia activities on Solar Two which included the project technical advisory committee and acting as the Department of Energy’s primary advisor. From 2002-2004, Dr. Tyner served as Chairman of the SolarPACES Executive Committee. Dr. Tyner holds a PhD in chemical engineering from the University of Illinois, where he was a NSF Fellow, and received his BS from the California Institute of Technology."}, {"name": "Bandel L. Carano", "description": " Bandel L. Carano, Managing Partner, joined Oak Investment Partners in 1985 and became a General Partner in 1987. Bandel’s investment focus is on Information Technology and Clean Energy."}, {"name": "Eric Belman", "description": " Eric Belman is a Business Development (M&A) Leader at GE Energy, a $35 billion portfolio of world-leading power generation equipment and related services businesses. Eric spends most of his time focused on GE’s power generation platforms, which include GE’s gas and steam turbine lines, generators, nuclear, gas engines, renewables, IGCC, and related power electronics product lines. He joined GE in 2007."}, {"name": "Brian Spitz", "description": " Brian Spitz is currently Vice President of Finance for American Tank & Fabricating Company, a steel fabricator and processor servicing primarily the energy, defense and construction markets. American Tank has three wholly owned subsidiaries and has a minority interest in Composhield A/S, a Danish company that manufacturers composites for the international defense industry."}]}