{"about": "Cellana, a leading developer of algae-based bioproducts, uses the most productive plants on earth—marine microalgae—to photosynthetically produce its ReNew™ line of Omega-3 EPA and DHA oils, animal feed, and biofuel feedstocks.\n\nCellana’s patented ALDUO™ system, a series of photobioreactors (PBRs) coupled with open ponds, enables economic and continuous production of diverse strains of microalgae.\n\nOur ALDUO™ system represents the optimal balance between higher-cost PBRs and lower-cost open ponds for consistent production without interruption by contamination.\n\nSince 2009, Cellana has operated its Kona Demonstration Facility, a 6-acre, state-of-the-art production and research facility in Hawaii. To date we have generated over 20 tons of algae to become one the most validated and prolific algae production facilities in the world.\n\nVideo: Cellana’s Kona Demonstration Facility, a 6-acre, state-of-the-art production and research facility in Hawaii, and the ALDUO™ algae production technology\n\nOver $100 million has been invested in the technologies being developed by Cellana, including through angel investments, government grants and contracts, strategic partner/joint venture funding, and investments made in the technologies in-licensed by Cellana.\n\nCellana intends to construct and operate commercial facilities to produce our ReNew™ product line as integrated algae-based biorefineries.\n\nAt Cellana, it’s a brand ReNew day! Please contact us to learn more about our company and products.", "name": "Home", "members": [{"name": "Clean Energy", "description": " With corporate headquarters in Chicago, Invenergy LLC is led by an experienced management team whose leadership and vision shape the company’s blueprint for continued profitable growth. Invenergy's senior executives are united in upholding the highest standards and values in guiding the company's daily operations, strategic long-term goals, and longstanding relationships with business partners and\nhost communities. With thirty years of experience in the energy industry, Michael Polsky is widely recognized as a pioneer and an industry leader in the cogeneration and independent power industry in North America. He founded leading clean energy company Invenergy more than ten years ago. Previously, in 1991, Polsky founded Sky Gen Energy - a developer, owner, and operator of natural gas-fueled generating plants – which was purchased by Calpine Corporation in 2001. Before forming SkyGen, Polsky co-founded and was President of Indeck Energy Services Inc. Polsky holds an MSME Degree from Kiev Polytechnic Institute and an MBA from the University of Chicago. In 2002, Polsky endowed a center for Entrepreneurship at the University of Chicago Graduate School of Business, which is named after him. Jim Murphy has more than thirty years of financial and management experience, primarily in the energy industry, having managed the negotiation and execution of nearly $20 billion in private equity and debt investments, power plant acquisitions and sales, and project debt and equity financing. He is a member of Invenergy’s founding group and is responsible for the general management of the company, as well as corporate and project finance, risk management, and asset optimization. Murphy currently is a member of the Board of Directors of the American Wind Energy Association (AWEA). Prior to the formation of Invenergy, he was Chief Financial Officer at Sky Gen Energy LLC, and previously was a Vice President with financial advisory and investment firm The Deerpath Group, Inc. and a manager with Arthur Andersen. He earned a BS from the University of Illinois, magna cum laude, and is a Certified Public Accountant. With more than 25 years of experience in all aspects of the power generation industry, Jim Shield is responsible for the development, marketing, engineering, and construction of Invenergy’s wind, solar, and thermal energy projects worldwide. During his career, he has developed over 8,500 MW of power projects and negotiated 3,000 MW of long-term energy off-take agreements. Prior to joining Invenergy, Shield held various positions with Calpine Corporation, including Senior Vice President-East Region. Earlier, he was a key contributor in building SkyGen Energy from a start-up company, and a project manager at Indeck Energy Services. Shield has a BS in Mechanical Engineering from the University of Michigan and an MBA from DePaul University. He is a Registered Professional Engineer in the State of Illinois. Alex George leads the operations and asset management of Invenergy’s growing portfolio of wind and thermal energy plants. He has nearly 30 years of broad experience in the power industry, having led the commissioning, operation, and asset management of more than 5,600 MW of natural gas generation and 1,800 MW of wind generation during his career. Prior to joining Invenergy in 2002, George was Vice President of Operations and Asset Management at Calpine. Before then, as one of the original team members at Sky Gen, he was Vice President of Operations and Asset Management. Previously, George was a professional engineer at both CRS Sirrine Engineers and Sargent & Lundy. He has a BS in Mechanical Engineering from the University of Illinois and an MBA from the University of Illinois-Chicago.  A twenty-year veteran of the power industry, Bryan Schueler is responsible for project development at Invenergy. He has experience in plant operations and engineering, as well as the development, permitting, and construction of biomass, wind, landfill gas, and natural gas projects. Over the course of two decades, Schueler has successfully managed the development and construction of more than 20 wind farms and over 2,500 MW of natural gas-fired facilities. Before joining Invenergy, Schueler was a project director at Calpine, fulfilling the same role he held earlier at SkyGen. Previously, he was a performance engineer at a 1,000 MW coal station for Commonwealth Edison. Schueler has a BS in Mechanical Engineering from Purdue University and an MBA from the University of Illinois.  Joe Condo oversees all corporate legal affairs for Invenergy, and is responsible for developing and implementing corporate legal policy. He serves the company as counsel on a wide range of transactions in North America and Europe, including private equity financings, mergers and acquisitions, and other commercial business, and also is Invenergy’s primary representative on federal legislative issues. Condo joined Invenergy after five years as senior counsel for Calpine Corporation. Earlier, he served as an assistant corporation counsel of the City of Chicago and an assistant attorney general for the State of Iowa. Condo has a BA in Communications from the University of California at Los Angeles and a JD from the University of Southern California. He is a member of the state bars of Illinois, Iowa, California, and the District of Columbia. Steve Ryder heads Invenergy’s financing, as well as the firm’s equity and debt portfolio, for the company’s wind, natural gas, and solar assets. He previously served in other managerial capacities at Invenergy, overseeing project accounting, financial reporting, and asset management functions. Ryder has more than two decades of experience, having served earlier as a Vice President at GE Energy Financial Services (GE Capital), and having worked at the International Finance Corporation (IFC), the U.S. Agency for International Development (USAID), and Lucent Technologies. A Chartered Financial Analyst, Ryder earned a Bachelor in Science in Electrical Engineering from Tufts University and a Masters in Public Affairs from Princeton University. Want more information on Invenergy’s portfolio of solar, wind, and natural gas-fueled energy generation projects in North America and Europe? Learn More  What does clean energy look like? Take a tour of our photo gallery! LEARN MORE  \nCopyright © 2015 Invenergy LLC / Invenergy Services LLC. All Rights Reserved.\n"}, {"name": "Natural Gas", "description": " With thirty years of experience in the energy industry, Michael Polsky is widely recognized as a pioneer and an industry leader in the cogeneration and independent power industry in North America. He founded leading clean energy company Invenergy more than ten years ago. Previously, in 1991, Polsky founded Sky Gen Energy - a developer, owner, and operator of natural gas-fueled generating plants – which was purchased by Calpine Corporation in 2001. Before forming SkyGen, Polsky co-founded and was President of Indeck Energy Services Inc. Polsky holds an MSME Degree from Kiev Polytechnic Institute and an MBA from the University of Chicago. In 2002, Polsky endowed a center for Entrepreneurship at the University of Chicago Graduate School of Business, which is named after him. Alex George leads the operations and asset management of Invenergy’s growing portfolio of wind and thermal energy plants. He has nearly 30 years of broad experience in the power industry, having led the commissioning, operation, and asset management of more than 5,600 MW of natural gas generation and 1,800 MW of wind generation during his career. Prior to joining Invenergy in 2002, George was Vice President of Operations and Asset Management at Calpine. Before then, as one of the original team members at Sky Gen, he was Vice President of Operations and Asset Management. Previously, George was a professional engineer at both CRS Sirrine Engineers and Sargent & Lundy. He has a BS in Mechanical Engineering from the University of Illinois and an MBA from the University of Illinois-Chicago.  A twenty-year veteran of the power industry, Bryan Schueler is responsible for project development at Invenergy. He has experience in plant operations and engineering, as well as the development, permitting, and construction of biomass, wind, landfill gas, and natural gas projects. Over the course of two decades, Schueler has successfully managed the development and construction of more than 20 wind farms and over 2,500 MW of natural gas-fired facilities. Before joining Invenergy, Schueler was a project director at Calpine, fulfilling the same role he held earlier at SkyGen. Previously, he was a performance engineer at a 1,000 MW coal station for Commonwealth Edison. Schueler has a BS in Mechanical Engineering from Purdue University and an MBA from the University of Illinois.  Steve Ryder heads Invenergy’s financing, as well as the firm’s equity and debt portfolio, for the company’s wind, natural gas, and solar assets. He previously served in other managerial capacities at Invenergy, overseeing project accounting, financial reporting, and asset management functions. Ryder has more than two decades of experience, having served earlier as a Vice President at GE Energy Financial Services (GE Capital), and having worked at the International Finance Corporation (IFC), the U.S. Agency for International Development (USAID), and Lucent Technologies. A Chartered Financial Analyst, Ryder earned a Bachelor in Science in Electrical Engineering from Tufts University and a Masters in Public Affairs from Princeton University. Want more information on Invenergy’s portfolio of solar, wind, and natural gas-fueled energy generation projects in North America and Europe? Learn More "}, {"name": "Photo Gallery", "description": " What does clean energy look like? Take a tour of our photo gallery! LEARN MORE "}]}