{"about": "Cellana, a leading developer of algae-based bioproducts, uses the most productive plants on earth—marine microalgae—to photosynthetically produce its ReNew™ line of Omega-3 EPA and DHA oils, animal feed, and biofuel feedstocks.\n\nCellana’s patented ALDUO™ system, a series of photobioreactors (PBRs) coupled with open ponds, enables economic and continuous production of diverse strains of microalgae.\n\nOur ALDUO™ system represents the optimal balance between higher-cost PBRs and lower-cost open ponds for consistent production without interruption by contamination.\n\nSince 2009, Cellana has operated its Kona Demonstration Facility, a 6-acre, state-of-the-art production and research facility in Hawaii. To date we have generated over 20 tons of algae to become one the most validated and prolific algae production facilities in the world.\n\nVideo: Cellana’s Kona Demonstration Facility, a 6-acre, state-of-the-art production and research facility in Hawaii, and the ALDUO™ algae production technology\n\nOver $100 million has been invested in the technologies being developed by Cellana, including through angel investments, government grants and contracts, strategic partner/joint venture funding, and investments made in the technologies in-licensed by Cellana.\n\nCellana intends to construct and operate commercial facilities to produce our ReNew™ product line as integrated algae-based biorefineries.\n\nAt Cellana, it’s a brand ReNew day! Please contact us to learn more about our company and products.", "name": "Home", "members": [{"name": "Navigation Systems", "description": " ION Geophysical's Concept Systems offers a comprehensive set of survey planning, modeling and analysis tools designed to deliver the best images as cost effectively as possible. ION Geophysical provides seismic data acquisition imaging systems for marine towed streamer and ocean bottom seismic, in addition to geophones for land seismic data acquisition. From geophones and recording systems to source technology, ION Geophysical has provided the industry with cutting-edge land seismic acquisition technologies that have become industry standards. ION Geophysical provides ccean bottom acquisition systems and services to overcome the toughest geophysical imaging challenges. ION Geophysical provides towed streamer and ocean bottom data acquisition imaging systems, software, and services for 2D, 3D, and 4D seismic programs. Our seismic programs provide a holistic understanding of the petroleum systems off the western and eastern coasts of Africa and help operators assess the hydrocarbon potential of this region. By tying into the five critical wells in the Chukchi Basin, ChukchiSPAN helps define the resource potential of the region's petroleum systems from the Barrow Arch in the east to the Russian border in the west. ION Geophysical offers a series of seismic data programs in the Asia Pacific region that provides E&P operators the insight into the petroleum systems of the region. BightSPAN is a regional geologic study comprised of 2D seismic data mapping the active petroleum systems and identifying potential limits of new and existing plays. ION's GeoVentures team custom-designed seismic programs that provide a holistic understanding of the petroleum systems off the coasts of Brazil, Argentina, Colombia, and in the areas of the southern Caribbean and northern margin of South America.  The programs off the coast of Brazil provide a comprehensive understanding of Brazil's highly productive petroleum systems. Contact ION for information about training and support for our marine acquisition systems, Concept Systems command and control software, and GMG's MESA software. Check out the ION Geophysical course lists for Marine Imaging Systems, and book training or find out more about customized courses. Check out the ION Geophysical course lists for Concept Systems, and book training or find out more about customized courses. Steve Bate offers a well-rounded view of the geophysical business, having served in multiple leadership capacities within ION since joining the company in 2005. He is a proven business and financial leader with over 30 years of broad experience and capabilities across multiple industries. Prior to joining ION, Mr. Bate was president of a $300 million residential construction company and, prior to that, founded his own consulting business to help lead organizations through change. Over the past decade he has served ION in various executive capacities, including Chief Financial Officer of our Solutions business line, Senior Vice President of our Sensor business line, Senior Vice President of our Land Imaging Systems division, Chief Executive Officer of INOVA, and Executive Vice President and Chief Operating Officer of our Systems division.  Education:Mr. Bate holds a Bachelor of Business Administration from the University of Houston."}, {"name": "Acquisition Systems", "description": " ION Geophysical's Concept Systems offers a comprehensive set of survey planning, modeling and analysis tools designed to deliver the best images as cost effectively as possible. ION Geophysical provides seismic data acquisition imaging systems for marine towed streamer and ocean bottom seismic, in addition to geophones for land seismic data acquisition. From geophones and recording systems to source technology, ION Geophysical has provided the industry with cutting-edge land seismic acquisition technologies that have become industry standards. ION Geophysical provides ccean bottom acquisition systems and services to overcome the toughest geophysical imaging challenges. ION Geophysical provides towed streamer and ocean bottom data acquisition imaging systems, software, and services for 2D, 3D, and 4D seismic programs. Our seismic programs provide a holistic understanding of the petroleum systems off the western and eastern coasts of Africa and help operators assess the hydrocarbon potential of this region. By tying into the five critical wells in the Chukchi Basin, ChukchiSPAN helps define the resource potential of the region's petroleum systems from the Barrow Arch in the east to the Russian border in the west. ION Geophysical offers a series of seismic data programs in the Asia Pacific region that provides E&P operators the insight into the petroleum systems of the region. BightSPAN is a regional geologic study comprised of 2D seismic data mapping the active petroleum systems and identifying potential limits of new and existing plays. ION's GeoVentures team custom-designed seismic programs that provide a holistic understanding of the petroleum systems off the coasts of Brazil, Argentina, Colombia, and in the areas of the southern Caribbean and northern margin of South America.  The programs off the coast of Brazil provide a comprehensive understanding of Brazil's highly productive petroleum systems. Contact ION for information about training and support for our marine acquisition systems, Concept Systems command and control software, and GMG's MESA software. Check out the ION Geophysical course lists for Marine Imaging Systems, and book training or find out more about customized courses. Check out the ION Geophysical course lists for Concept Systems, and book training or find out more about customized courses. Steve Bate offers a well-rounded view of the geophysical business, having served in multiple leadership capacities within ION since joining the company in 2005. He is a proven business and financial leader with over 30 years of broad experience and capabilities across multiple industries. Prior to joining ION, Mr. Bate was president of a $300 million residential construction company and, prior to that, founded his own consulting business to help lead organizations through change. Over the past decade he has served ION in various executive capacities, including Chief Financial Officer of our Solutions business line, Senior Vice President of our Sensor business line, Senior Vice President of our Land Imaging Systems division, Chief Executive Officer of INOVA, and Executive Vice President and Chief Operating Officer of our Systems division.  Education:Mr. Bate holds a Bachelor of Business Administration from the University of Houston."}, {"name": "Towed Streamer", "description": " Comprehensive suite of products addresses the navigation requirements of 2D, 3D, and 4D seismic surveys for both towed streamer and ocean bottom seismic (OBS) operations. ION Geophysical provides seismic data acquisition imaging systems for marine towed streamer and ocean bottom seismic, in addition to geophones for land seismic data acquisition. ION Geophysical's industry-leading towed streamer technology enables superior marine seismic data to be acquired safely and efficiently. ION Geophysical provides towed streamer and ocean bottom data acquisition imaging systems, software, and services for 2D, 3D, and 4D seismic programs."}, {"name": "Ocean Bottom", "description": " Comprehensive suite of products addresses the navigation requirements of 2D, 3D, and 4D seismic surveys for both towed streamer and ocean bottom seismic (OBS) operations. ION Geophysical provides seismic data acquisition imaging systems for marine towed streamer and ocean bottom seismic, in addition to geophones for land seismic data acquisition. ION Geophysical provides ccean bottom acquisition systems and services to overcome the toughest geophysical imaging challenges. ION Geophysical provides towed streamer and ocean bottom data acquisition imaging systems, software, and services for 2D, 3D, and 4D seismic programs. Colin Hulme joined ION in 2012 as Senior Vice President, Strategic Marketing and in 2013 was promoted to Senior Vice President, Ocean Bottom Services, and appointed to serve as CEO of OceanGeo B.V., a joint venture controlled by ION. Prior to joining ION, Mr. Hulme held a variety of senior management positions at Schlumberger, Ltd., a global oilfield and information services company, from 1989 through 2011, including serving as Technical Director of Deep Reading for Schlumberger Wireline from 2006 to 2011, Vice President and General Manager of Seismic Data Processing for WesternGeco, a seismic solutions and technology subsidiary of Schlumberger, from 2002 to 2006, Vice President and General Manager for Reservoir Products, Schlumberger Information Services, from 2000 to 2002, Vice President and Business Manager for Asia Region, Schlumberger Information Services, from 1998 to 2000, and Corporate Marketing and Commercialization Manager for WesternGeco from 1994 to 1998. Prior to joining Schlumberger, Mr. Hulme began his career at Digicon Geophysical.< Education:Mr. Hulme attended Columbia School of Business Marketing School and was educated in the UK in Mathematics and Physics."}, {"name": "Data Processing", "description": " ION Geophysical is a proven technology innovator constantly advancing survey design software, acquisition equipment, command and control software, and data processing to support worldwide seismic operations. Rio helps solve seismic QC issues during acquisition to expedite seismic data processing workflows. ION Geophysical delivers a full suite of seismic data processing services through a seasoned team of experts who share an uncompromising commitment to provide the highest quality image. ION Geophysical’s GX Technology offers advanced seismic data processing with a vast experience in critical marine processing techniques, including subsalt imaging. Take a tour of our processing centers and projects. ION’s GXT has teams of experts strategically located throughout the Americas, Europe, and West Africa. ION's Reservoir Solutions team has extensive experience in the complex process of regional rock physics studies involving log processing, rock physics modeling, seismic modeling and verification. ION's Reservoir Solutions team offers fully integrated design, processing, and interpretation services to maximize the value of your Vertical Seismic Profiles (VSP) investment. A fully integrated OBS solution, including survey design and planning, data acquisition, data processing, interpretation and reservoir services, delivering superior OBS data for enhanced reservoir understanding.  Including all things seismic in the oil & gas industry, the articles in this section discuss everything from seismic data processing techniques to the latest acquisition technology and more.   ION’s multimedia library includes videos for Arctic seismic programs, BasinSPANS, data processing centers, marine seismic acquisition and more. ION’s multimedia library includes image galleries for INOVA Technologies, marine acquisition, seismic data software and processing and more. The ION’s library of brochures and data sheets includes information on our innovative seismic technologies, geophones, marine seismic acquisition and positioning equipment, command and control software, data processing services, seismic data programs, and more. Chris Usher brings over twenty-five years of leadership in the geophysical industry and hands-on experience in the fields of seismic data processing and imaging, new product commercialization, and software development.Mr. Usher began his career in field operations at Western Geophysical. In 2000, he moved to Petroleum Geo-Services (PGS) in London and served as President of its global data processing division until 2004. From 2004 to 2005, he served as Senior Corporate Vice President, Integrated Services, at Paradigm Geotechnology in London. In 2005, Mr. Usher joined Landmark Software and Services, a division of Halliburton, as Senior Director. From 2010 until 2012, Mr. Usher served as Senior Vice President and Chief Technology Officer for Global Geophysical. Mr. Usher joined ION in December 2012 as Executive Vice President and Chief Operating Officer of ION's GX Technology group and was appointed Executive Vice President and Chief Innovation Officer in February 2015.Education:Mr. Usher is a graduate of Yale University with a Bachelor of Science degree in geology and geophysics. Colin Hulme joined ION in 2012 as Senior Vice President, Strategic Marketing and in 2013 was promoted to Senior Vice President, Ocean Bottom Services, and appointed to serve as CEO of OceanGeo B.V., a joint venture controlled by ION. Prior to joining ION, Mr. Hulme held a variety of senior management positions at Schlumberger, Ltd., a global oilfield and information services company, from 1989 through 2011, including serving as Technical Director of Deep Reading for Schlumberger Wireline from 2006 to 2011, Vice President and General Manager of Seismic Data Processing for WesternGeco, a seismic solutions and technology subsidiary of Schlumberger, from 2002 to 2006, Vice President and General Manager for Reservoir Products, Schlumberger Information Services, from 2000 to 2002, Vice President and Business Manager for Asia Region, Schlumberger Information Services, from 1998 to 2000, and Corporate Marketing and Commercialization Manager for WesternGeco from 1994 to 1998. Prior to joining Schlumberger, Mr. Hulme began his career at Digicon Geophysical.< Education:Mr. Hulme attended Columbia School of Business Marketing School and was educated in the UK in Mathematics and Physics."}, {"name": "Advanced Imaging", "description": " ION Geophysical provides seismic data acquisition imaging systems for marine towed streamer and ocean bottom seismic, in addition to geophones for land seismic data acquisition. ION Geophysical provides ccean bottom acquisition systems and services to overcome the toughest geophysical imaging challenges. ION Geophysical provides towed streamer and ocean bottom data acquisition imaging systems, software, and services for 2D, 3D, and 4D seismic programs. By enhancing the signal-to-noise ratio, ION's GX Technology group is able to optimize seismic data for advanced pre-stack time and depth imaging. As one of the industry leaders in pre-stack depth migration and reverse time migration (RTM), ION's GX Technology group provides advanced land and marine imaging to solve the toughest imaging challenges. By utilizing full azimuth and multicomponent data, ION's GX Technology full-wave imaging services help E&P operators solve exploration challenges and reduce drilling risk by providing a more complete understanding of the reservoir. ION Geophysical’s GX Technology offers advanced seismic data processing with a vast experience in critical marine processing techniques, including subsalt imaging. ION's Reservoir Solutions team of experienced geoscientists delivers solutions to E&P challenges in time and depth seismic imaging, geology, geostatistics, petrophysics, geophysics, reservoir engineering and simulation, and petroleum economics. Check out the ION Geophysical course lists for Marine Imaging Systems, and book training or find out more about customized courses. Brian Hanson brings a background of distinguished leadership to ION, having served in executive roles for various science and technology companies.  Prior to his appointment as CEO of ION, Mr. Hanson served as our Chief Financial Officer from 2006 until 2011. Beginning in 1986 until 1998, Mr. Hanson served in various positions with Culligan, an international water treatment products manufacturer and a producer and retailer of bottled water products. His positions with Culligan included Vice President of Finance and Chief Financial Officer. From 1998 to 2003, Mr. Hanson held a variety of positions at Fisher Scientific International Inc., a NYSE-listed manufacturer and supplier of scientific and healthcare products and services, including Vice President of Finance for the Healthcare group from 1998 to 2002 and Chief Operating Officer from 2002 to 2003. Immediately prior to joining ION, Mr. Hanson served as Executive Vice President and Chief Financial Officer of Alliance Imaging, Inc., an NYSE-listed provider of diagnostic imaging services to hospitals and other healthcare providers.Education:Mr. Hanson holds a bachelor's degree in engineering from the University of New Brunswick and an MBA degree from Concordia University in Montreal. Steve Bate offers a well-rounded view of the geophysical business, having served in multiple leadership capacities within ION since joining the company in 2005. He is a proven business and financial leader with over 30 years of broad experience and capabilities across multiple industries. Prior to joining ION, Mr. Bate was president of a $300 million residential construction company and, prior to that, founded his own consulting business to help lead organizations through change. Over the past decade he has served ION in various executive capacities, including Chief Financial Officer of our Solutions business line, Senior Vice President of our Sensor business line, Senior Vice President of our Land Imaging Systems division, Chief Executive Officer of INOVA, and Executive Vice President and Chief Operating Officer of our Systems division.  Education:Mr. Bate holds a Bachelor of Business Administration from the University of Houston. Chris Usher brings over twenty-five years of leadership in the geophysical industry and hands-on experience in the fields of seismic data processing and imaging, new product commercialization, and software development.Mr. Usher began his career in field operations at Western Geophysical. In 2000, he moved to Petroleum Geo-Services (PGS) in London and served as President of its global data processing division until 2004. From 2004 to 2005, he served as Senior Corporate Vice President, Integrated Services, at Paradigm Geotechnology in London. In 2005, Mr. Usher joined Landmark Software and Services, a division of Halliburton, as Senior Director. From 2010 until 2012, Mr. Usher served as Senior Vice President and Chief Technology Officer for Global Geophysical. Mr. Usher joined ION in December 2012 as Executive Vice President and Chief Operating Officer of ION's GX Technology group and was appointed Executive Vice President and Chief Innovation Officer in February 2015.Education:Mr. Usher is a graduate of Yale University with a Bachelor of Science degree in geology and geophysics."}, {"name": "Land Processing", "description": " ION Geophysical is a proven technology innovator constantly advancing survey design software, acquisition equipment, command and control software, and data processing to support worldwide seismic operations. Rio helps solve seismic QC issues during acquisition to expedite seismic data processing workflows. ION Geophysical delivers a full suite of seismic data processing services through a seasoned team of experts who share an uncompromising commitment to provide the highest quality image. ION Geophysical’s GX Technology offers advanced seismic data processing with a vast experience in critical marine processing techniques, including subsalt imaging. Take a tour of our processing centers and projects. ION’s GXT has teams of experts strategically located throughout the Americas, Europe, and West Africa. ION's Reservoir Solutions team has extensive experience in the complex process of regional rock physics studies involving log processing, rock physics modeling, seismic modeling and verification. ION's Reservoir Solutions team offers fully integrated design, processing, and interpretation services to maximize the value of your Vertical Seismic Profiles (VSP) investment. A fully integrated OBS solution, including survey design and planning, data acquisition, data processing, interpretation and reservoir services, delivering superior OBS data for enhanced reservoir understanding.  Including all things seismic in the oil & gas industry, the articles in this section discuss everything from seismic data processing techniques to the latest acquisition technology and more.   ION’s multimedia library includes videos for Arctic seismic programs, BasinSPANS, data processing centers, marine seismic acquisition and more. ION’s multimedia library includes image galleries for INOVA Technologies, marine acquisition, seismic data software and processing and more. The ION’s library of brochures and data sheets includes information on our innovative seismic technologies, geophones, marine seismic acquisition and positioning equipment, command and control software, data processing services, seismic data programs, and more. Chris Usher brings over twenty-five years of leadership in the geophysical industry and hands-on experience in the fields of seismic data processing and imaging, new product commercialization, and software development.Mr. Usher began his career in field operations at Western Geophysical. In 2000, he moved to Petroleum Geo-Services (PGS) in London and served as President of its global data processing division until 2004. From 2004 to 2005, he served as Senior Corporate Vice President, Integrated Services, at Paradigm Geotechnology in London. In 2005, Mr. Usher joined Landmark Software and Services, a division of Halliburton, as Senior Director. From 2010 until 2012, Mr. Usher served as Senior Vice President and Chief Technology Officer for Global Geophysical. Mr. Usher joined ION in December 2012 as Executive Vice President and Chief Operating Officer of ION's GX Technology group and was appointed Executive Vice President and Chief Innovation Officer in February 2015.Education:Mr. Usher is a graduate of Yale University with a Bachelor of Science degree in geology and geophysics. Colin Hulme joined ION in 2012 as Senior Vice President, Strategic Marketing and in 2013 was promoted to Senior Vice President, Ocean Bottom Services, and appointed to serve as CEO of OceanGeo B.V., a joint venture controlled by ION. Prior to joining ION, Mr. Hulme held a variety of senior management positions at Schlumberger, Ltd., a global oilfield and information services company, from 1989 through 2011, including serving as Technical Director of Deep Reading for Schlumberger Wireline from 2006 to 2011, Vice President and General Manager of Seismic Data Processing for WesternGeco, a seismic solutions and technology subsidiary of Schlumberger, from 2002 to 2006, Vice President and General Manager for Reservoir Products, Schlumberger Information Services, from 2000 to 2002, Vice President and Business Manager for Asia Region, Schlumberger Information Services, from 1998 to 2000, and Corporate Marketing and Commercialization Manager for WesternGeco from 1994 to 1998. Prior to joining Schlumberger, Mr. Hulme began his career at Digicon Geophysical.< Education:Mr. Hulme attended Columbia School of Business Marketing School and was educated in the UK in Mathematics and Physics."}, {"name": "Marine Processing", "description": " ION Geophysical is a proven technology innovator constantly advancing survey design software, acquisition equipment, command and control software, and data processing to support worldwide seismic operations. Rio helps solve seismic QC issues during acquisition to expedite seismic data processing workflows. ION Geophysical delivers a full suite of seismic data processing services through a seasoned team of experts who share an uncompromising commitment to provide the highest quality image. ION Geophysical’s GX Technology offers advanced seismic data processing with a vast experience in critical marine processing techniques, including subsalt imaging. Take a tour of our processing centers and projects. ION’s GXT has teams of experts strategically located throughout the Americas, Europe, and West Africa. ION's Reservoir Solutions team has extensive experience in the complex process of regional rock physics studies involving log processing, rock physics modeling, seismic modeling and verification. ION's Reservoir Solutions team offers fully integrated design, processing, and interpretation services to maximize the value of your Vertical Seismic Profiles (VSP) investment. A fully integrated OBS solution, including survey design and planning, data acquisition, data processing, interpretation and reservoir services, delivering superior OBS data for enhanced reservoir understanding.  Including all things seismic in the oil & gas industry, the articles in this section discuss everything from seismic data processing techniques to the latest acquisition technology and more.   ION’s multimedia library includes videos for Arctic seismic programs, BasinSPANS, data processing centers, marine seismic acquisition and more. ION’s multimedia library includes image galleries for INOVA Technologies, marine acquisition, seismic data software and processing and more. The ION’s library of brochures and data sheets includes information on our innovative seismic technologies, geophones, marine seismic acquisition and positioning equipment, command and control software, data processing services, seismic data programs, and more. Chris Usher brings over twenty-five years of leadership in the geophysical industry and hands-on experience in the fields of seismic data processing and imaging, new product commercialization, and software development.Mr. Usher began his career in field operations at Western Geophysical. In 2000, he moved to Petroleum Geo-Services (PGS) in London and served as President of its global data processing division until 2004. From 2004 to 2005, he served as Senior Corporate Vice President, Integrated Services, at Paradigm Geotechnology in London. In 2005, Mr. Usher joined Landmark Software and Services, a division of Halliburton, as Senior Director. From 2010 until 2012, Mr. Usher served as Senior Vice President and Chief Technology Officer for Global Geophysical. Mr. Usher joined ION in December 2012 as Executive Vice President and Chief Operating Officer of ION's GX Technology group and was appointed Executive Vice President and Chief Innovation Officer in February 2015.Education:Mr. Usher is a graduate of Yale University with a Bachelor of Science degree in geology and geophysics. Colin Hulme joined ION in 2012 as Senior Vice President, Strategic Marketing and in 2013 was promoted to Senior Vice President, Ocean Bottom Services, and appointed to serve as CEO of OceanGeo B.V., a joint venture controlled by ION. Prior to joining ION, Mr. Hulme held a variety of senior management positions at Schlumberger, Ltd., a global oilfield and information services company, from 1989 through 2011, including serving as Technical Director of Deep Reading for Schlumberger Wireline from 2006 to 2011, Vice President and General Manager of Seismic Data Processing for WesternGeco, a seismic solutions and technology subsidiary of Schlumberger, from 2002 to 2006, Vice President and General Manager for Reservoir Products, Schlumberger Information Services, from 2000 to 2002, Vice President and Business Manager for Asia Region, Schlumberger Information Services, from 1998 to 2000, and Corporate Marketing and Commercialization Manager for WesternGeco from 1994 to 1998. Prior to joining Schlumberger, Mr. Hulme began his career at Digicon Geophysical.< Education:Mr. Hulme attended Columbia School of Business Marketing School and was educated in the UK in Mathematics and Physics."}, {"name": "Arctic Processing", "description": " ION Geophysical is a proven technology innovator constantly advancing survey design software, acquisition equipment, command and control software, and data processing to support worldwide seismic operations. Rio helps solve seismic QC issues during acquisition to expedite seismic data processing workflows. ION Geophysical delivers a full suite of seismic data processing services through a seasoned team of experts who share an uncompromising commitment to provide the highest quality image. ION Geophysical’s GX Technology offers advanced seismic data processing with a vast experience in critical marine processing techniques, including subsalt imaging. Take a tour of our processing centers and projects. ION’s GXT has teams of experts strategically located throughout the Americas, Europe, and West Africa. ION's Reservoir Solutions team has extensive experience in the complex process of regional rock physics studies involving log processing, rock physics modeling, seismic modeling and verification. ION's Reservoir Solutions team offers fully integrated design, processing, and interpretation services to maximize the value of your Vertical Seismic Profiles (VSP) investment. A fully integrated OBS solution, including survey design and planning, data acquisition, data processing, interpretation and reservoir services, delivering superior OBS data for enhanced reservoir understanding.  Including all things seismic in the oil & gas industry, the articles in this section discuss everything from seismic data processing techniques to the latest acquisition technology and more.   ION’s multimedia library includes videos for Arctic seismic programs, BasinSPANS, data processing centers, marine seismic acquisition and more. ION’s multimedia library includes image galleries for INOVA Technologies, marine acquisition, seismic data software and processing and more. The ION’s library of brochures and data sheets includes information on our innovative seismic technologies, geophones, marine seismic acquisition and positioning equipment, command and control software, data processing services, seismic data programs, and more. Chris Usher brings over twenty-five years of leadership in the geophysical industry and hands-on experience in the fields of seismic data processing and imaging, new product commercialization, and software development.Mr. Usher began his career in field operations at Western Geophysical. In 2000, he moved to Petroleum Geo-Services (PGS) in London and served as President of its global data processing division until 2004. From 2004 to 2005, he served as Senior Corporate Vice President, Integrated Services, at Paradigm Geotechnology in London. In 2005, Mr. Usher joined Landmark Software and Services, a division of Halliburton, as Senior Director. From 2010 until 2012, Mr. Usher served as Senior Vice President and Chief Technology Officer for Global Geophysical. Mr. Usher joined ION in December 2012 as Executive Vice President and Chief Operating Officer of ION's GX Technology group and was appointed Executive Vice President and Chief Innovation Officer in February 2015.Education:Mr. Usher is a graduate of Yale University with a Bachelor of Science degree in geology and geophysics. Colin Hulme joined ION in 2012 as Senior Vice President, Strategic Marketing and in 2013 was promoted to Senior Vice President, Ocean Bottom Services, and appointed to serve as CEO of OceanGeo B.V., a joint venture controlled by ION. Prior to joining ION, Mr. Hulme held a variety of senior management positions at Schlumberger, Ltd., a global oilfield and information services company, from 1989 through 2011, including serving as Technical Director of Deep Reading for Schlumberger Wireline from 2006 to 2011, Vice President and General Manager of Seismic Data Processing for WesternGeco, a seismic solutions and technology subsidiary of Schlumberger, from 2002 to 2006, Vice President and General Manager for Reservoir Products, Schlumberger Information Services, from 2000 to 2002, Vice President and Business Manager for Asia Region, Schlumberger Information Services, from 1998 to 2000, and Corporate Marketing and Commercialization Manager for WesternGeco from 1994 to 1998. Prior to joining Schlumberger, Mr. Hulme began his career at Digicon Geophysical.< Education:Mr. Hulme attended Columbia School of Business Marketing School and was educated in the UK in Mathematics and Physics."}, {"name": "Attribute Analysis", "description": " ION Geophysical's Concept Systems offers a comprehensive set of survey planning, modeling and analysis tools designed to deliver the best images as cost effectively as possible. ION's Reservoir Solutions team provides advanced attribute analysis of key seismic attributes to identify and distinguish important reservoir and lithology characteristics. ION's Reservoir Solutions team is dedicated to developing and implementing proven and innovative interpretation techniques from geologic analysis and lithologic mapping to fracture detection and production optimization."}, {"name": "Fracture Detection", "description": " ION’s Reservoir Solutions team has extensive experience in fracture detection in tight sands, shale plays, and carbonate reservoirs and can provide enhanced fracture detection to optimize drilling plans. ION's Reservoir Solutions team is dedicated to developing and implementing proven and innovative interpretation techniques from geologic analysis and lithologic mapping to fracture detection and production optimization."}, {"name": "Interactive Map", "description": " ION's Reservoir Solutions team is dedicated to developing and implementing proven and innovative interpretation techniques from geologic analysis and lithologic mapping to fracture detection and production optimization. BightSPAN is a regional geologic study comprised of 2D seismic data mapping the active petroleum systems and identifying potential limits of new and existing plays."}, {"name": "East AfricaSPAN", "description": ""}, {"name": "Asia Pacific", "description": " Tour ION’s data library featuring programs in Africa, the Arctic, Latin America, the Gulf of Mexico, India, Asia Pacific, the North Atlantic, and more.  ION Geophysical offers a series of seismic data programs in the Asia Pacific region that provides E&P operators the insight into the petroleum systems of the region."}, {"name": "Black SeaSPAN", "description": ""}, {"name": "North America", "description": " Take a tour of our processing centers and projects. ION’s GXT has teams of experts strategically located throughout the Americas, Europe, and West Africa. Tour ION’s data library featuring programs in Africa, the Arctic, Latin America, the Gulf of Mexico, India, Asia Pacific, the North Atlantic, and more.  Covering a number of key regions in North America, ION Geophysical's seismic data programs are comprised of both offshore and onshore, 2D BasinSPAN and 3D ResSCAN programs. ION's GeoVentures team custom-designed seismic programs that provide a holistic understanding of the petroleum systems off the coasts of Brazil, Argentina, Colombia, and in the areas of the southern Caribbean and northern margin of South America.  Jamey Seely joins ION as an accomplished executive and business leader. Ms. Seely’s energy industry experience includes various roles in mergers & acquisitions, securities and private placements, commercial transactions, corporate governance, and finance transactions including the negotiation of several multi-billion dollar facilities and investments.Prior to joining ION, Ms. Seely served as Senior Vice President of Alternative Energy for NRG Energy, Inc., with management and legal oversight of multiple new business and startup ventures related to enhanced oil recovery, solar power and nuclear project development. She also recently served in executive and general counsel roles for Nuclear Innovation North America (NINA), a joint venture subsidiary of NRG Energy in conjunction with Toshiba Corporation. Prior to NRG Energy, Jamey served as Vice President and General Counsel at Direct Energy, and as Partner in Corporate and Securities Law with Thompson & Knight LLP.Education:Ms. Seely holds a Juris Doctor from Southern Methodist University’s Dedman School of Law and earned a Bachelor of Arts degree magna cum laude at Baylor University.  She also holds a Professional Certificate in Energy Innovation & Emerging Technologies from Stanford University.  She is licensed to practice in Texas and New York."}, {"name": "Marcellus Shale", "description": " ION’s GX Technology group has the tools, knowledge, and experience to help E&P operators better understand the geology of unconventional reservoirs including shale and tight gas plays, enabling them to maximize exploration and production. ION’s Reservoir Solutions team has extensive experience in fracture detection in tight sands, shale plays, and carbonate reservoirs and can provide enhanced fracture detection to optimize drilling plans. ION's Reservoir Solutions team is uniquely qualified to help E&P operators understand the geology of unconventional reservoirs, including shale plays, and to help maximize exploration and production of these reservoirs. ION's multi-client surveys in the Marcellus shale provide operators a better understanding of the play to determine acreage assessment, identify optimum well locations, and maximize production."}, {"name": "Niobrara Shale", "description": " ION’s GX Technology group has the tools, knowledge, and experience to help E&P operators better understand the geology of unconventional reservoirs including shale and tight gas plays, enabling them to maximize exploration and production. ION’s Reservoir Solutions team has extensive experience in fracture detection in tight sands, shale plays, and carbonate reservoirs and can provide enhanced fracture detection to optimize drilling plans. ION's Reservoir Solutions team is uniquely qualified to help E&P operators understand the geology of unconventional reservoirs, including shale plays, and to help maximize exploration and production of these reservoirs. ION's multi-client surveys in the Marcellus shale provide operators a better understanding of the play to determine acreage assessment, identify optimum well locations, and maximize production."}, {"name": "Mississippi Lime", "description": ""}, {"name": "South America", "description": " Take a tour of our processing centers and projects. ION’s GXT has teams of experts strategically located throughout the Americas, Europe, and West Africa. Tour ION’s data library featuring programs in Africa, the Arctic, Latin America, the Gulf of Mexico, India, Asia Pacific, the North Atlantic, and more.  Covering a number of key regions in North America, ION Geophysical's seismic data programs are comprised of both offshore and onshore, 2D BasinSPAN and 3D ResSCAN programs. ION's GeoVentures team custom-designed seismic programs that provide a holistic understanding of the petroleum systems off the coasts of Brazil, Argentina, Colombia, and in the areas of the southern Caribbean and northern margin of South America.  Jamey Seely joins ION as an accomplished executive and business leader. Ms. Seely’s energy industry experience includes various roles in mergers & acquisitions, securities and private placements, commercial transactions, corporate governance, and finance transactions including the negotiation of several multi-billion dollar facilities and investments.Prior to joining ION, Ms. Seely served as Senior Vice President of Alternative Energy for NRG Energy, Inc., with management and legal oversight of multiple new business and startup ventures related to enhanced oil recovery, solar power and nuclear project development. She also recently served in executive and general counsel roles for Nuclear Innovation North America (NINA), a joint venture subsidiary of NRG Energy in conjunction with Toshiba Corporation. Prior to NRG Energy, Jamey served as Vice President and General Counsel at Direct Energy, and as Partner in Corporate and Securities Law with Thompson & Knight LLP.Education:Ms. Seely holds a Juris Doctor from Southern Methodist University’s Dedman School of Law and earned a Bachelor of Arts degree magna cum laude at Baylor University.  She also holds a Professional Certificate in Energy Innovation & Emerging Technologies from Stanford University.  She is licensed to practice in Texas and New York."}, {"name": "The Guianas", "description": ""}, {"name": "Case Studies", "description": " ION's Reservoir Solutions team has extensive experience in the complex process of regional rock physics studies involving log processing, rock physics modeling, seismic modeling and verification. PolandSPAN is multi-phased program that will provide the foundation of integrated geologic knowledge and a consistent seismic framework from which to build future studies. ION’s Case Studies tell the stories of our problem solving approach and applications of technology and provide a deeper dive into the capabilities of our diverse team of people and experts. Jacques P. Leveille has a proven history of delivering cutting-edge innovations in technology and integration to the global E&P market. He joined ION in 2010 and brings with him a broad industry perspective, with particular expertise in seismic technology and R&D applications. Prior to joining the Shell Development Company at the Bellaire Research Center in Houston in 1982, Mr. Leveille served as research faculty at the University of Michigan in Ann Arbor, focused primarily on elementary particle physics. He also completed doctoral studies and post-doctoral appointments at Imperial College in London and the University of Wisconsin at Madison. In 1994, he joined Hess Corporation where he held many appointments, including Chief Geophysicist, until 2010. Mr. Leveille is also the current Chair of the SEG Research Committee. Education:Mr. Leveille received a PhD in Physics from Boston University in 1976.  Leveille served as research faculty at the University of Michigan in Ann Arbor, focused primarily on elementary particle physics, and completed doctoral studies and post-doctoral appointments at Imperial College in London and the University of Wisconsin at Madison."}, {"name": "Industry Links", "description": " ION’s resource center includes links to geophysical societies, government energy agencies, geophysical research groups, world energy reports, and more."}, {"name": "Data Sheets", "description": " The ION’s library of brochures and data sheets includes information on our innovative seismic technologies, geophones, marine seismic acquisition and positioning equipment, command and control software, data processing services, seismic data programs, and more. Browse our library of ION Geophysical product data sheets for information about our innovative seismic technologies, marine seismic acquisition and more."}, {"name": "Search Resources", "description": " With over 35 years of Human Resources experience, Larry Burke has applied his knowledge and experience to help shape the unique culture of technology and innovation at ION. Prior to his current title of Executive Vice President, he served as Senior Vice President of Global Human Resources. He joined ION in 2008. From 1990 to 1994, Mr. Burke served as Vice President of Human Resources for Silicon Valley Group, a semiconductor equipment manufacturer. Between 1994 and 2000, he was Senior Vice President of Human Resources and Administration for the institutional broker/dealer BNY/ESI & Co. More recently, Mr. Burke served as Vice President of Human Resources at Global Crossing, a global telecommunications solutions provider, from 2000 to 2008. Education:Mr. Burke holds a bachelor's degree from Loyola College in Baltimore, Maryland."}, {"name": "R. Brian Hanson", "description": " Brian Hanson brings a background of distinguished leadership to ION, having served in executive roles for various science and technology companies.  Prior to his appointment as CEO of ION, Mr. Hanson served as our Chief Financial Officer from 2006 until 2011. Beginning in 1986 until 1998, Mr. Hanson served in various positions with Culligan, an international water treatment products manufacturer and a producer and retailer of bottled water products. His positions with Culligan included Vice President of Finance and Chief Financial Officer. From 1998 to 2003, Mr. Hanson held a variety of positions at Fisher Scientific International Inc., a NYSE-listed manufacturer and supplier of scientific and healthcare products and services, including Vice President of Finance for the Healthcare group from 1998 to 2002 and Chief Operating Officer from 2002 to 2003. Immediately prior to joining ION, Mr. Hanson served as Executive Vice President and Chief Financial Officer of Alliance Imaging, Inc., an NYSE-listed provider of diagnostic imaging services to hospitals and other healthcare providers.Education:Mr. Hanson holds a bachelor's degree in engineering from the University of New Brunswick and an MBA degree from Concordia University in Montreal."}, {"name": "Steve Bate", "description": " Steve Bate offers a well-rounded view of the geophysical business, having served in multiple leadership capacities within ION since joining the company in 2005. He is a proven business and financial leader with over 30 years of broad experience and capabilities across multiple industries. Prior to joining ION, Mr. Bate was president of a $300 million residential construction company and, prior to that, founded his own consulting business to help lead organizations through change. Over the past decade he has served ION in various executive capacities, including Chief Financial Officer of our Solutions business line, Senior Vice President of our Sensor business line, Senior Vice President of our Land Imaging Systems division, Chief Executive Officer of INOVA, and Executive Vice President and Chief Operating Officer of our Systems division.  Education:Mr. Bate holds a Bachelor of Business Administration from the University of Houston."}, {"name": "Chris Usher", "description": " Chris Usher brings over twenty-five years of leadership in the geophysical industry and hands-on experience in the fields of seismic data processing and imaging, new product commercialization, and software development.Mr. Usher began his career in field operations at Western Geophysical. In 2000, he moved to Petroleum Geo-Services (PGS) in London and served as President of its global data processing division until 2004. From 2004 to 2005, he served as Senior Corporate Vice President, Integrated Services, at Paradigm Geotechnology in London. In 2005, Mr. Usher joined Landmark Software and Services, a division of Halliburton, as Senior Director. From 2010 until 2012, Mr. Usher served as Senior Vice President and Chief Technology Officer for Global Geophysical. Mr. Usher joined ION in December 2012 as Executive Vice President and Chief Operating Officer of ION's GX Technology group and was appointed Executive Vice President and Chief Innovation Officer in February 2015.Education:Mr. Usher is a graduate of Yale University with a Bachelor of Science degree in geology and geophysics."}, {"name": "Ken Williamson", "description": " Ken Williamson brings to ION broad international experience in the seismic industry. Mr. Williamson joined ION in 2006 to lead the development and expansion of our data library programs and was appointed Executive Vice President and Chief Operating Officer, Commercialization in February 2015. Between 1987 and 2006, Mr. Williamson was employed in various positions by Western Geophysical, which in 2000 became part of WesternGeco, a seismic solutions and technology subsidiary of Schlumberger. While at WesternGeco, he served as Vice President, Marketing from 2001 to 2003; Vice President, Russia and Caspian Region from 2003 to 2005; and Vice President, Marketing, Sales & Commercialization of WesternGeco's electromagnetic services and technology division from 2005 to 2006. Mr. Williamson joined ION in 2006 as Vice President of our GeoVentures group and was appointed Executive Vice President and Chief Operating Officer in December 2012.  Education:Mr. Williamson holds a Bachelor of Science degree in geophysics from Cardiff University in Wales."}, {"name": "Larry Burke", "description": " With over 35 years of Human Resources experience, Larry Burke has applied his knowledge and experience to help shape the unique culture of technology and innovation at ION. Prior to his current title of Executive Vice President, he served as Senior Vice President of Global Human Resources. He joined ION in 2008. From 1990 to 1994, Mr. Burke served as Vice President of Human Resources for Silicon Valley Group, a semiconductor equipment manufacturer. Between 1994 and 2000, he was Senior Vice President of Human Resources and Administration for the institutional broker/dealer BNY/ESI & Co. More recently, Mr. Burke served as Vice President of Human Resources at Global Crossing, a global telecommunications solutions provider, from 2000 to 2008. Education:Mr. Burke holds a bachelor's degree from Loyola College in Baltimore, Maryland."}, {"name": "Colin Hulme", "description": " Colin Hulme joined ION in 2012 as Senior Vice President, Strategic Marketing and in 2013 was promoted to Senior Vice President, Ocean Bottom Services, and appointed to serve as CEO of OceanGeo B.V., a joint venture controlled by ION. Prior to joining ION, Mr. Hulme held a variety of senior management positions at Schlumberger, Ltd., a global oilfield and information services company, from 1989 through 2011, including serving as Technical Director of Deep Reading for Schlumberger Wireline from 2006 to 2011, Vice President and General Manager of Seismic Data Processing for WesternGeco, a seismic solutions and technology subsidiary of Schlumberger, from 2002 to 2006, Vice President and General Manager for Reservoir Products, Schlumberger Information Services, from 2000 to 2002, Vice President and Business Manager for Asia Region, Schlumberger Information Services, from 1998 to 2000, and Corporate Marketing and Commercialization Manager for WesternGeco from 1994 to 1998. Prior to joining Schlumberger, Mr. Hulme began his career at Digicon Geophysical.< Education:Mr. Hulme attended Columbia School of Business Marketing School and was educated in the UK in Mathematics and Physics."}, {"name": "Jacques Leveille", "description": " Jacques P. Leveille has a proven history of delivering cutting-edge innovations in technology and integration to the global E&P market. He joined ION in 2010 and brings with him a broad industry perspective, with particular expertise in seismic technology and R&D applications. Prior to joining the Shell Development Company at the Bellaire Research Center in Houston in 1982, Mr. Leveille served as research faculty at the University of Michigan in Ann Arbor, focused primarily on elementary particle physics. He also completed doctoral studies and post-doctoral appointments at Imperial College in London and the University of Wisconsin at Madison. In 1994, he joined Hess Corporation where he held many appointments, including Chief Geophysicist, until 2010. Mr. Leveille is also the current Chair of the SEG Research Committee. Education:Mr. Leveille received a PhD in Physics from Boston University in 1976.  Leveille served as research faculty at the University of Michigan in Ann Arbor, focused primarily on elementary particle physics, and completed doctoral studies and post-doctoral appointments at Imperial College in London and the University of Wisconsin at Madison."}, {"name": "Jamey Seely", "description": " Jamey Seely joins ION as an accomplished executive and business leader. Ms. Seely’s energy industry experience includes various roles in mergers & acquisitions, securities and private placements, commercial transactions, corporate governance, and finance transactions including the negotiation of several multi-billion dollar facilities and investments.Prior to joining ION, Ms. Seely served as Senior Vice President of Alternative Energy for NRG Energy, Inc., with management and legal oversight of multiple new business and startup ventures related to enhanced oil recovery, solar power and nuclear project development. She also recently served in executive and general counsel roles for Nuclear Innovation North America (NINA), a joint venture subsidiary of NRG Energy in conjunction with Toshiba Corporation. Prior to NRG Energy, Jamey served as Vice President and General Counsel at Direct Energy, and as Partner in Corporate and Securities Law with Thompson & Knight LLP.Education:Ms. Seely holds a Juris Doctor from Southern Methodist University’s Dedman School of Law and earned a Bachelor of Arts degree magna cum laude at Baylor University.  She also holds a Professional Certificate in Energy Innovation & Emerging Technologies from Stanford University.  She is licensed to practice in Texas and New York."}, {"name": "Why ION?", "description": " At ION Geophysical, our vision is to integrate the capabilites across the company and through our partners to solve the toughest problems in the industry. ION Geophysical cultivates a diverse culture filled with industry experts who thrive in our entrepreneurial environment to develop customized seismic solutions and groundbreaking technologies. ION Geophysical is a proven technology innovator constantly advancing survey design software, acquisition equipment, command and control software, and data processing to support worldwide seismic operations. ION Geophysical is committed to improve the quality of our products and services, provide a safe work environment for our employees, and protect the environment. ION Geophysical provides industry-leading survey design software and services to design, model, plan, and execute the most complex seismic surveys in all acquisition environments. ION Geophysical's Concept Systems offers a comprehensive set of survey planning, modeling and analysis tools designed to deliver the best images as cost effectively as possible. ION Geophysical's Field Acquisition Specialists manage software and operations to dynamically optimize marine acquisition from survey planning to the final shot point. ION's MESA survey design software provides unprecedented design, planning, and modeling capabilities for land and marine acquisition projects. By combining multiple data sources, Narwhal helps vessel captains, ice pilots and analysts to better visualize and predict ice conditions, and better plan Arctic seismic and drilling operations and mitigate risk. Comprehensive suite of products addresses the navigation requirements of 2D, 3D, and 4D seismic surveys for both towed streamer and ocean bottom seismic (OBS) operations. Rio helps solve seismic QC issues during acquisition to expedite seismic data processing workflows. Marlin, the first fully integrated commercial software solution for optimizing simultaneous operations during seismic acquisition. ION Geophysical provides seismic data acquisition imaging systems for marine towed streamer and ocean bottom seismic, in addition to geophones for land seismic data acquisition. From geophones and recording systems to source technology, ION Geophysical has provided the industry with cutting-edge land seismic acquisition technologies that have become industry standards. ION Geophysical's industry-leading towed streamer technology enables superior marine seismic data to be acquired safely and efficiently. ION Geophysical provides ccean bottom acquisition systems and services to overcome the toughest geophysical imaging challenges. ION Geophysical's Sensor group provides geophones and ancillary geophone equipment to capture high-quality data in any seismic data acquisition environment. INOVA Geophysical Equipment develops land seismic equipment for data acquisition in any operating environment. ION Geophysical provides towed streamer and ocean bottom data acquisition imaging systems, software, and services for 2D, 3D, and 4D seismic programs. ION Geophysical delivers a full suite of seismic data processing services through a seasoned team of experts who share an uncompromising commitment to provide the highest quality image. By enhancing the signal-to-noise ratio, ION's GX Technology group is able to optimize seismic data for advanced pre-stack time and depth imaging. As one of the industry leaders in pre-stack depth migration and reverse time migration (RTM), ION's GX Technology group provides advanced land and marine imaging to solve the toughest imaging challenges. By utilizing full azimuth and multicomponent data, ION's GX Technology full-wave imaging services help E&P operators solve exploration challenges and reduce drilling risk by providing a more complete understanding of the reservoir. ION’s GX Technology group has the tools, knowledge, and experience to help E&P operators better understand the geology of unconventional reservoirs including shale and tight gas plays, enabling them to maximize exploration and production. ION Geophysical’s GX Technology offers advanced seismic data processing with a vast experience in critical marine processing techniques, including subsalt imaging. Take a tour of our processing centers and projects. ION’s GXT has teams of experts strategically located throughout the Americas, Europe, and West Africa. ION’s Reservoir Services' team provides a range of offerinngs, from individual services such as simultaneous inversions or pore pressure prediction, to fully integrated interpretations including selection of optimized well locations. ION's Reservoir Solutions team has extensive experience in the complex process of regional rock physics studies involving log processing, rock physics modeling, seismic modeling and verification. ION's Reservoir Solutions team offers a variety of different inversions including acoustic impedance, shear impedance, elastic, simultaneous and joint inversions. ION's GX Technology has developed next-generation AVO tools and approaches that extend the utility and application of the technique. ION's Reservoir Solutions team provides advanced attribute analysis of key seismic attributes to identify and distinguish important reservoir and lithology characteristics. ION’s Reservoir Solutions team has extensive experience in fracture detection in tight sands, shale plays, and carbonate reservoirs and can provide enhanced fracture detection to optimize drilling plans. ION's Reservoir Solutions team is uniquely qualified to help E&P operators understand the geology of unconventional reservoirs, including shale plays, and to help maximize exploration and production of these reservoirs. ION's Reservoir Solutions team is dedicated to developing and implementing proven and innovative interpretation techniques from geologic analysis and lithologic mapping to fracture detection and production optimization. ION's Reservoir Solutions team of experienced geoscientists delivers solutions to E&P challenges in time and depth seismic imaging, geology, geostatistics, petrophysics, geophysics, reservoir engineering and simulation, and petroleum economics. ION's Reservoir Solutions group uses a high-resolution pore pressure prediction workflow to prepare an un-risked reconnaissance 3D pore pressure prediction. ION's Reservoir Solutions team offers fully integrated design, processing, and interpretation services to maximize the value of your Vertical Seismic Profiles (VSP) investment. A fully integrated OBS solution, including survey design and planning, data acquisition, data processing, interpretation and reservoir services, delivering superior OBS data for enhanced reservoir understanding.  Tour ION’s data library featuring programs in Africa, the Arctic, Latin America, the Gulf of Mexico, India, Asia Pacific, the North Atlantic, and more.  Our seismic programs provide a holistic understanding of the petroleum systems off the western and eastern coasts of Africa and help operators assess the hydrocarbon potential of this region. Located offshore Madagascar, Kenya, and Tanzania, East AfricaSPSAN is a regional seismic program and geologic study designed to understand large-scale hydrocarbon potential.  Consisting of 11,000 km of data, NamibiaSPAN provides insight into the architecture of various basins along the Namibian margin. BeaufortSPAN consists of over 23,000 km of deeply imaged regional data that has fundamentally changed the understanding of the production potential of the MacKenzie Delta, Beaufort Passive, and the Banks Island Basin area. The BeaufortSPAN East Potential Fields Program is an airborne magnetic survey that provides a regional framework spanning the area west of Banks Island to the Southern Sverdrup Basin. By tying into the five critical wells in the Chukchi Basin, ChukchiSPAN helps define the resource potential of the region's petroleum systems from the Barrow Arch in the east to the Russian border in the west. Northeast GreenlandSPAN is largely comprised of data acquired through ION's proprietary acquisition technology and provides critical insight into this highly potential but challenging region. ION Geophysical offers a series of seismic data programs in the Asia Pacific region that provides E&P operators the insight into the petroleum systems of the region. BightSPAN is a regional geologic study comprised of 2D seismic data mapping the active petroleum systems and identifying potential limits of new and existing plays. JavaSPAN is a regional seismic data program and geologic study that extends from Madura Island, East Java to south of Sulawesi and north into the Makassar Straits. ION's GeoVentures team has designed unique programs in Europe and the Middle East that provide an improved understanding of the geologic evolution and basin architecture of these regions. Northeast AtlanticSPAN is a regional 2D seismic survey that provides a highly consistent dataset designed to image the less explored areas recognized to contain hydrocarbon potential beneath thick basalts. PolandSPAN is multi-phased program that will provide the foundation of integrated geologic knowledge and a consistent seismic framework from which to build future studies. Acquired in two phases, IndiaSPAN is a regional seismic data program and geologic study covering the major basins off the east and west coasts of India.  Covering a number of key regions in North America, ION Geophysical's seismic data programs are comprised of both offshore and onshore, 2D BasinSPAN and 3D ResSCAN programs. NovaSPAN provides a comprehensive understanding into the geologic evolution and basin architecture of the margins of Nova Scotia and Newfoundland. ION's multi-client surveys in the Marcellus shale provide operators a better understanding of the play to determine acreage assessment, identify optimum well locations, and maximize production. ION's NiobraraSCAN 3D multi-client seismic survey features densely-sampled, 3C seismic data for better characterization of the highly fractured Niobrara Formation. ION's GeoVentures team custom-designed seismic programs that provide a holistic understanding of the petroleum systems off the coasts of Brazil, Argentina, Colombia, and in the areas of the southern Caribbean and northern margin of South America.  ArgentineSPAN provides and improved understanding of the geologic evolution of the Argentine Atlantic margin and its deep basin architecture. Designed to deliver superior insight into the geologic evolution and basin architecture of the region, ColombiaSPAN provides a regional 2D seismic framework of the offshore area of Colombia. PeruSPAN is a  program designed to acquire multi-client, 2D seismic data to improve understanding of the region's tectonics as well as new and existing play types offshore Peru.  Including all things seismic in the oil & gas industry, the articles in this section discuss everything from seismic data processing techniques to the latest acquisition technology and more.   ION’s Abstracts and Technical Papers cover a wide range of topics written by our in-house industry experts detailing the latest theories, research, and conclusions on some of the industry's hottest topics. ION’s Case Studies tell the stories of our problem solving approach and applications of technology and provide a deeper dive into the capabilities of our diverse team of people and experts. Contact ION for information about training and support for our marine acquisition systems, Concept Systems command and control software, and GMG's MESA software. Check out the ION Geophysical course lists for Marine Imaging Systems, and book training or find out more about customized courses. Check out the ION Geophysical course lists for Concept Systems, and book training or find out more about customized courses. ION’s digital media library includes videos, presentations that highlight the history of innovation, entreprenurial spirit, and culture of collaboration at ION. ION’s multimedia library includes videos for Arctic seismic programs, BasinSPANS, data processing centers, marine seismic acquisition and more. ION’s multimedia library includes image galleries for INOVA Technologies, marine acquisition, seismic data software and processing and more. ION’s resource center includes links to geophysical societies, government energy agencies, geophysical research groups, world energy reports, and more. The ION’s library of brochures and data sheets includes information on our innovative seismic technologies, geophones, marine seismic acquisition and positioning equipment, command and control software, data processing services, seismic data programs, and more. Browse our library of ION Geophysical brochures for information about our innovative seismic technologies, marine seismic acquisition and more. Browse our library of ION Geophysical field service bulletins for more information about our Sensor Geophones and Marine seismic data acquisition. Browse our library of ION Geophysical product data sheets for information about our innovative seismic technologies, marine seismic acquisition and more. Brian Hanson brings a background of distinguished leadership to ION, having served in executive roles for various science and technology companies.  Prior to his appointment as CEO of ION, Mr. Hanson served as our Chief Financial Officer from 2006 until 2011. Beginning in 1986 until 1998, Mr. Hanson served in various positions with Culligan, an international water treatment products manufacturer and a producer and retailer of bottled water products. His positions with Culligan included Vice President of Finance and Chief Financial Officer. From 1998 to 2003, Mr. Hanson held a variety of positions at Fisher Scientific International Inc., a NYSE-listed manufacturer and supplier of scientific and healthcare products and services, including Vice President of Finance for the Healthcare group from 1998 to 2002 and Chief Operating Officer from 2002 to 2003. Immediately prior to joining ION, Mr. Hanson served as Executive Vice President and Chief Financial Officer of Alliance Imaging, Inc., an NYSE-listed provider of diagnostic imaging services to hospitals and other healthcare providers.Education:Mr. Hanson holds a bachelor's degree in engineering from the University of New Brunswick and an MBA degree from Concordia University in Montreal. Steve Bate offers a well-rounded view of the geophysical business, having served in multiple leadership capacities within ION since joining the company in 2005. He is a proven business and financial leader with over 30 years of broad experience and capabilities across multiple industries. Prior to joining ION, Mr. Bate was president of a $300 million residential construction company and, prior to that, founded his own consulting business to help lead organizations through change. Over the past decade he has served ION in various executive capacities, including Chief Financial Officer of our Solutions business line, Senior Vice President of our Sensor business line, Senior Vice President of our Land Imaging Systems division, Chief Executive Officer of INOVA, and Executive Vice President and Chief Operating Officer of our Systems division.  Education:Mr. Bate holds a Bachelor of Business Administration from the University of Houston. Executive Vice President and Chief Innovation Officer, Innovation Chris Usher brings over twenty-five years of leadership in the geophysical industry and hands-on experience in the fields of seismic data processing and imaging, new product commercialization, and software development.Mr. Usher began his career in field operations at Western Geophysical. In 2000, he moved to Petroleum Geo-Services (PGS) in London and served as President of its global data processing division until 2004. From 2004 to 2005, he served as Senior Corporate Vice President, Integrated Services, at Paradigm Geotechnology in London. In 2005, Mr. Usher joined Landmark Software and Services, a division of Halliburton, as Senior Director. From 2010 until 2012, Mr. Usher served as Senior Vice President and Chief Technology Officer for Global Geophysical. Mr. Usher joined ION in December 2012 as Executive Vice President and Chief Operating Officer of ION's GX Technology group and was appointed Executive Vice President and Chief Innovation Officer in February 2015.Education:Mr. Usher is a graduate of Yale University with a Bachelor of Science degree in geology and geophysics. Executive Vice President and Chief Operating Officer, Commercialization Ken Williamson brings to ION broad international experience in the seismic industry. Mr. Williamson joined ION in 2006 to lead the development and expansion of our data library programs and was appointed Executive Vice President and Chief Operating Officer, Commercialization in February 2015. Between 1987 and 2006, Mr. Williamson was employed in various positions by Western Geophysical, which in 2000 became part of WesternGeco, a seismic solutions and technology subsidiary of Schlumberger. While at WesternGeco, he served as Vice President, Marketing from 2001 to 2003; Vice President, Russia and Caspian Region from 2003 to 2005; and Vice President, Marketing, Sales & Commercialization of WesternGeco's electromagnetic services and technology division from 2005 to 2006. Mr. Williamson joined ION in 2006 as Vice President of our GeoVentures group and was appointed Executive Vice President and Chief Operating Officer in December 2012.  Education:Mr. Williamson holds a Bachelor of Science degree in geophysics from Cardiff University in Wales. With over 35 years of Human Resources experience, Larry Burke has applied his knowledge and experience to help shape the unique culture of technology and innovation at ION. Prior to his current title of Executive Vice President, he served as Senior Vice President of Global Human Resources. He joined ION in 2008. From 1990 to 1994, Mr. Burke served as Vice President of Human Resources for Silicon Valley Group, a semiconductor equipment manufacturer. Between 1994 and 2000, he was Senior Vice President of Human Resources and Administration for the institutional broker/dealer BNY/ESI & Co. More recently, Mr. Burke served as Vice President of Human Resources at Global Crossing, a global telecommunications solutions provider, from 2000 to 2008. Education:Mr. Burke holds a bachelor's degree from Loyola College in Baltimore, Maryland. Colin Hulme joined ION in 2012 as Senior Vice President, Strategic Marketing and in 2013 was promoted to Senior Vice President, Ocean Bottom Services, and appointed to serve as CEO of OceanGeo B.V., a joint venture controlled by ION. Prior to joining ION, Mr. Hulme held a variety of senior management positions at Schlumberger, Ltd., a global oilfield and information services company, from 1989 through 2011, including serving as Technical Director of Deep Reading for Schlumberger Wireline from 2006 to 2011, Vice President and General Manager of Seismic Data Processing for WesternGeco, a seismic solutions and technology subsidiary of Schlumberger, from 2002 to 2006, Vice President and General Manager for Reservoir Products, Schlumberger Information Services, from 2000 to 2002, Vice President and Business Manager for Asia Region, Schlumberger Information Services, from 1998 to 2000, and Corporate Marketing and Commercialization Manager for WesternGeco from 1994 to 1998. Prior to joining Schlumberger, Mr. Hulme began his career at Digicon Geophysical.< Education:Mr. Hulme attended Columbia School of Business Marketing School and was educated in the UK in Mathematics and Physics. Jacques P. Leveille has a proven history of delivering cutting-edge innovations in technology and integration to the global E&P market. He joined ION in 2010 and brings with him a broad industry perspective, with particular expertise in seismic technology and R&D applications. Prior to joining the Shell Development Company at the Bellaire Research Center in Houston in 1982, Mr. Leveille served as research faculty at the University of Michigan in Ann Arbor, focused primarily on elementary particle physics. He also completed doctoral studies and post-doctoral appointments at Imperial College in London and the University of Wisconsin at Madison. In 1994, he joined Hess Corporation where he held many appointments, including Chief Geophysicist, until 2010. Mr. Leveille is also the current Chair of the SEG Research Committee. Education:Mr. Leveille received a PhD in Physics from Boston University in 1976.  Leveille served as research faculty at the University of Michigan in Ann Arbor, focused primarily on elementary particle physics, and completed doctoral studies and post-doctoral appointments at Imperial College in London and the University of Wisconsin at Madison. Jamey Seely joins ION as an accomplished executive and business leader. Ms. Seely’s energy industry experience includes various roles in mergers & acquisitions, securities and private placements, commercial transactions, corporate governance, and finance transactions including the negotiation of several multi-billion dollar facilities and investments.Prior to joining ION, Ms. Seely served as Senior Vice President of Alternative Energy for NRG Energy, Inc., with management and legal oversight of multiple new business and startup ventures related to enhanced oil recovery, solar power and nuclear project development. She also recently served in executive and general counsel roles for Nuclear Innovation North America (NINA), a joint venture subsidiary of NRG Energy in conjunction with Toshiba Corporation. Prior to NRG Energy, Jamey served as Vice President and General Counsel at Direct Energy, and as Partner in Corporate and Securities Law with Thompson & Knight LLP.Education:Ms. Seely holds a Juris Doctor from Southern Methodist University’s Dedman School of Law and earned a Bachelor of Arts degree magna cum laude at Baylor University.  She also holds a Professional Certificate in Energy Innovation & Emerging Technologies from Stanford University.  She is licensed to practice in Texas and New York. ION Headquarters2105 CityWest Blvd, Suite 400Houston, TX 77042-2839P: (+1) 281 933 3339F: (+1) 281 879 3626E: info@iongeo.com"}, {"name": "Data Library", "description": " Tour ION’s data library featuring programs in Africa, the Arctic, Latin America, the Gulf of Mexico, India, Asia Pacific, the North Atlantic, and more.  ION’s digital media library includes videos, presentations that highlight the history of innovation, entreprenurial spirit, and culture of collaboration at ION. ION’s multimedia library includes videos for Arctic seismic programs, BasinSPANS, data processing centers, marine seismic acquisition and more. ION’s multimedia library includes image galleries for INOVA Technologies, marine acquisition, seismic data software and processing and more. The ION’s library of brochures and data sheets includes information on our innovative seismic technologies, geophones, marine seismic acquisition and positioning equipment, command and control software, data processing services, seismic data programs, and more. Browse our library of ION Geophysical brochures for information about our innovative seismic technologies, marine seismic acquisition and more. Browse our library of ION Geophysical field service bulletins for more information about our Sensor Geophones and Marine seismic data acquisition. Browse our library of ION Geophysical product data sheets for information about our innovative seismic technologies, marine seismic acquisition and more. Ken Williamson brings to ION broad international experience in the seismic industry. Mr. Williamson joined ION in 2006 to lead the development and expansion of our data library programs and was appointed Executive Vice President and Chief Operating Officer, Commercialization in February 2015. Between 1987 and 2006, Mr. Williamson was employed in various positions by Western Geophysical, which in 2000 became part of WesternGeco, a seismic solutions and technology subsidiary of Schlumberger. While at WesternGeco, he served as Vice President, Marketing from 2001 to 2003; Vice President, Russia and Caspian Region from 2003 to 2005; and Vice President, Marketing, Sales & Commercialization of WesternGeco's electromagnetic services and technology division from 2005 to 2006. Mr. Williamson joined ION in 2006 as Vice President of our GeoVentures group and was appointed Executive Vice President and Chief Operating Officer in December 2012.  Education:Mr. Williamson holds a Bachelor of Science degree in geophysics from Cardiff University in Wales."}, {"name": "Resource Center", "description": " Take a tour of our processing centers and projects. ION’s GXT has teams of experts strategically located throughout the Americas, Europe, and West Africa. ION’s multimedia library includes videos for Arctic seismic programs, BasinSPANS, data processing centers, marine seismic acquisition and more. ION’s resource center includes links to geophysical societies, government energy agencies, geophysical research groups, world energy reports, and more. Jacques P. Leveille has a proven history of delivering cutting-edge innovations in technology and integration to the global E&P market. He joined ION in 2010 and brings with him a broad industry perspective, with particular expertise in seismic technology and R&D applications. Prior to joining the Shell Development Company at the Bellaire Research Center in Houston in 1982, Mr. Leveille served as research faculty at the University of Michigan in Ann Arbor, focused primarily on elementary particle physics. He also completed doctoral studies and post-doctoral appointments at Imperial College in London and the University of Wisconsin at Madison. In 1994, he joined Hess Corporation where he held many appointments, including Chief Geophysicist, until 2010. Mr. Leveille is also the current Chair of the SEG Research Committee. Education:Mr. Leveille received a PhD in Physics from Boston University in 1976.  Leveille served as research faculty at the University of Michigan in Ann Arbor, focused primarily on elementary particle physics, and completed doctoral studies and post-doctoral appointments at Imperial College in London and the University of Wisconsin at Madison."}]}