{"about": "Cellana, a leading developer of algae-based bioproducts, uses the most productive plants on earth—marine microalgae—to photosynthetically produce its ReNew™ line of Omega-3 EPA and DHA oils, animal feed, and biofuel feedstocks.\n\nCellana’s patented ALDUO™ system, a series of photobioreactors (PBRs) coupled with open ponds, enables economic and continuous production of diverse strains of microalgae.\n\nOur ALDUO™ system represents the optimal balance between higher-cost PBRs and lower-cost open ponds for consistent production without interruption by contamination.\n\nSince 2009, Cellana has operated its Kona Demonstration Facility, a 6-acre, state-of-the-art production and research facility in Hawaii. To date we have generated over 20 tons of algae to become one the most validated and prolific algae production facilities in the world.\n\nVideo: Cellana’s Kona Demonstration Facility, a 6-acre, state-of-the-art production and research facility in Hawaii, and the ALDUO™ algae production technology\n\nOver $100 million has been invested in the technologies being developed by Cellana, including through angel investments, government grants and contracts, strategic partner/joint venture funding, and investments made in the technologies in-licensed by Cellana.\n\nCellana intends to construct and operate commercial facilities to produce our ReNew™ product line as integrated algae-based biorefineries.\n\nAt Cellana, it’s a brand ReNew day! Please contact us to learn more about our company and products.", "name": "Home", "members": [{"name": "Eric Yasunaga", "description": " (808) 295-4653\neric.yasunaga@islandpacificenergy.com\nAs Senior VP of Business Development for Island Pacific Energy, Eric is primarily responsible for identifying new business opportunities and developing a professional sales organization. He ensures a rewarding and seamless experience for our commercial and residential clients. "}, {"name": "Joseph Saturnia", "description": " (808) 377-6401\njoseph.saturnia@islandpacificenergy.com\nAs President and Founder of Island Pacific Energy, Joe is responsible for setting the overall direction of the company, investigating new technologies and arranging sources of financing for photovoltaic projects.\n"}, {"name": "Van Matsushige", "description": " (808) 377-6405\nvan.matsushige@islandpacificenergy.com\nAs VP of Operations, Van oversees all operations and management of the design and construction phases of Island Pacific Energy projects.\n"}, {"name": "Jordan Bush", "description": " (808) 799-8682 jordan.bush@islandpacificenergy.com\nAs Island Pacific Energy’s Operations Manager, Jordan manages and supervises all installation crews and oversees all projects. Customer satisfaction is his primary goal."}, {"name": "Zachary Lee", "description": " (808) 377-6402 zac.lee@islandpacificenergy.com\nAs our System Engineer, Zak designs systems unique to each project. He works collaboratively with our entire team to deliver a system tailored for our customers.  (808) 377-6403\nkeala.kinimaka-lee@islandpacificenergy.com\nKeala’s primary responsibilities include all accounting and human resource functions in addition to overseeing administrative and office management.  (808) 520-5144\nrory.lee@islandpacificenergy.com\nAs VP of Business Development for Island Pacific Energy, Rory is a graduate of the Kamehameha Schools. He also has a B.S. in Business Administration from the University of Southern California. Rory enjoys helping residential & commercial clients with their energy needs. He is a service volunteer with Hawaii Meals on Wheels and East Honolulu Rotary.\n"}, {"name": "Keala Kinimaka-Lee", "description": " (808) 377-6403\nkeala.kinimaka-lee@islandpacificenergy.com\nKeala’s primary responsibilities include all accounting and human resource functions in addition to overseeing administrative and office management. "}, {"name": "Stacey Kawano", "description": " (808) 377-6406 stacey.kawano@islandpacificenergy.com\nAs Customer Service Manager, Stacey monitors all documentation and oversees the permitting process. She works closely with the IPE team to ensure internal organization and the smooth success of our projects.\n"}, {"name": "Lyle Awakuni", "description": " (808) 748-9050\nlyle.awakuni@islandpacificenergy.com\nAs VP of Business Development for Island Pacific Energy, Lyle works closely with commercial and residential clients to analyze and identify their specific solar energy needs and identification of creative, cost-effective solutions.  Lyle is an experienced sales professional with demonstrated ability in achieving win-win outcomes with clients.\n"}, {"name": "Nicole Gibson", "description": " (808) 938-3697\nnicole.gibson@islandpacificenergy.com\nAs VP of Business Development for Island Pacific Energy, Nicole strives to develop and build strong relationships with her residential and commercial clients. She provides homeowners with clean energy solutions and is dedicated to being there every step of the way.\n"}, {"name": "Tyler Kimura", "description": " (808) 221-8425\ntyler.kimura@islandpacificenergy.com\nAs VP of Business Development for Island Pacific Energy, Tyler is responsible for providing clean energy solutions and flexible finance options for our residential and commercial customers.\n"}, {"name": "Rory Lee", "description": " (808) 377-6402 zac.lee@islandpacificenergy.com\nAs our System Engineer, Zak designs systems unique to each project. He works collaboratively with our entire team to deliver a system tailored for our customers.  (808) 377-6403\nkeala.kinimaka-lee@islandpacificenergy.com\nKeala’s primary responsibilities include all accounting and human resource functions in addition to overseeing administrative and office management.  (808) 520-5144\nrory.lee@islandpacificenergy.com\nAs VP of Business Development for Island Pacific Energy, Rory is a graduate of the Kamehameha Schools. He also has a B.S. in Business Administration from the University of Southern California. Rory enjoys helping residential & commercial clients with their energy needs. He is a service volunteer with Hawaii Meals on Wheels and East Honolulu Rotary.\n"}, {"name": "Start Saving Today", "description": ""}, {"name": "Quick Links", "description": ""}]}