{"about": "Originally founded in 1906 as an intrastate natural gas pipeline business in Oklahoma, today ONEOK is one of the nation's premier energy companies involved in the natural gas and natural gas liquids businesses. Its business segments provide safe, reliable energy and services to their diverse customers. By following a strategy that blends the performance and profitability of all of the segments, ONEOK is able to deliver sustainable earnings growth for shareholders. ONEOK’s success is driven by employees who strive to better not only their company but also the communities in which they live.", "name": "ONEOK", "members": [{"name": "Terry K. Spencer", "description": " Terry Spencer is president and chief executive officer of ONEOK and ONEOK Partners, responsible for the organizations’ operations and support functions, including corporate planning and development, human resources, information technology, corporate services, and investor relations and public affairs. He is a member of the ONEOK Partners board of directors.  Spencer joined ONEOK in 2001 as director, project development, for natural gas gathering and processing. Later, he served as vice president of natural gas supply and project development in the natural gas gathering and processing segment. In 2005, Spencer became senior vice president of ONEOK’s natural gas liquids business following the asset acquisition from Koch. He became president of natural gas liquids in 2006. From 2007 to 2009, he was executive vice president of ONEOK, with responsibilities for ONEOK Partners’ natural gas liquids gathering and fractionation, and pipeline segments, as well as ONEOK’s energy services segment. He most recently served as chief operating officer of ONEOK Partners and was responsible for the partnership’s three operating segments – natural gas gathering and processing, natural gas pipelines and natural gas liquids. Prior to joining ONEOK, Spencer held positions of increasing responsibility in the natural gas gathering and processing industry with Continental Natural Gas, Inc., in Tulsa; Stellar Gas Company in Houston; and Texas Oil and Gas Corporation’s Delhi Gas Pipeline subsidiary in Dallas.  Spencer earned a Bachelor of Science degree in petroleum engineering in 1981 from the University of Alabama in Tuscaloosa."}, {"name": "Stephen W. Lake", "description": " Steve Lake is senior vice president, general counsel and assistant secretary of ONEOK and ONEOK Partners. Lake serves on the board of trustees of Saint Simeon’s Episcopal Home, where he also has served as president and chairman of the board. He is a past chairman and committee member of several fundraising events for Prevent Blindness Oklahoma, and past committee member of fundraising events for the Cystic Fibrosis Foundation.  A native of Tulsa, Lake earned his Bachelor of Arts degree in 1987 from Vanderbilt University, where he graduated cum laude. He received his Juris Doctorate in 1991 from the University of Oklahoma. "}, {"name": "Derek S. Reiners", "description": " Derek Reiners is senior vice president, chief financial officer and treasurer, ONEOK and ONEOK Partners, after serving as senior vice president and chief accounting officer, ONEOK and ONEOK Partners, since joining the company in 2009.   A certified public accountant and a member of the American Institute of Certified Public Accountants, Reiners earned a Bachelor of Science degree in business administration in 1993 from Oklahoma State University in Stillwater with majors in finance and economics.  He earned a master’s degree in accounting in 1999 from Oklahoma State University."}, {"name": "Charles M. Kelley", "description": " Chuck Kelley is senior vice president, corporate planning and development, responsible for business development, financial forecasting, strategic and long-range planning, and capital investment economic analysis. Before being named to his current position in February 2015, he was vice president, commercial development for ONEOK and ONEOK Partners. From 2008 until 2014, Kelley served as senior vice president of ONEOK Energy Services Company, responsible for wholesale origination, business development and transportation and storage. He joined ONEOK in 2000 as manager of Midwest marketing for ONEOK Energy Marketing & Trading Company and later served as director of marketing and vice president of origination. Prior to joining ONEOK, Kelley held executive positions at both Tartan Energy Resources and Panda Resources, Inc. He also held various positions with Enron Corporation.  Kelley is a former member of the Midwest Energy Association where he has served as director of the energy management committee. He is a current member and past board member of the Natural Gas and Energy Association of Oklahoma. Kelley also is a member of the board of directors of the Oklahoma Aquarium Foundation and is a volunteer with Challenger League youth sports and Special Olympics Oklahoma. A native of Illinois, Kelley earned a Bachelor of Science degree in finance, with honors, in 1980 from DePaul University, College of Commerce, in Chicago."}, {"name": "S. Eric Grimshaw", "description": " Eric Grimshaw is vice president, associate general counsel and corporate secretary of ONEOK and ONEOK Partners. Grimshaw is a past president and chairman of Tulsa Opera. He also is a past chairman of Junior Achievement of Greater Tulsa and past secretary of the Oklahoma Alliance for Manufacturing Excellence. He was a member of the board of directors of XETA Technologies, Inc., a provider of advanced communication technologies located in Tulsa, until the company was sold in 2011. A Tulsa native, Grimshaw earned a Bachelor of Arts degree in 1974 from the University of Colorado in Boulder and received his Juris Doctorate in 1977 from the University of Tulsa."}, {"name": "Mike F. Miers III", "description": ""}, {"name": "Jeremy D. Wiese", "description": " Jeremy Wiese is vice president of environment, safety and health, and asset integrity, where he oversees the organization’s capabilities related to protecting the environment, safety and health of all employees, contractors, customers and communities where the company operates. A native of Nebraska, Wiese earned a Bachelor of Science degree in mechanical engineering in 1993 from Oklahoma State University in Stillwater."}, {"name": "Brien H. Brown", "description": " Brien Brown is vice president and chief information officer.  He joined ONEOK in 2009 as director, corporate applications. From 2006 to 2009, Brown worked for SAP Americas, following 14 years at CITGO Petroleum Corp., where he held a variety of positions of increasing responsibility, including manager, information technology applications. He began his career in 1989 as an auditor and certified public accountant for Price Waterhouse, now PricewaterhouseCoopers. Brown earned a Bachelor of Business Administration degree in accounting and management information systems in 1989 from the University of Oklahoma in Norman."}, {"name": "Sheridan C. Swords", "description": " Sheridan Swords is senior vice president, natural gas liquids of ONEOK Partners, responsible for natural gas liquids gathering, fractionation, storage and pipelines. Prior to assuming this position, Swords was president of the natural gas liquids gathering and fractionation segment. Swords began his career in the energy industry as a division engineer for Koch Gathering Systems Company in 1992. He held various positions with Koch companies, including operations management and commercial and commodity trading.  Prior to joining ONEOK Partners in 2005, Swords was vice president of the Mid-Continent of Koch Hydrocarbon, LP.  A native of Kansas, Swords earned a Bachelor of Science degree in mechanical engineering in 1991 from Kansas State University in Manhattan."}, {"name": "Kevin L. Burdick", "description": " Kevin Burdick is vice president of natural gas gathering and processing of ONEOK. Burdick joined ONEOK in 2007 as manager of information technology design integration. Prior to that, he held information technology positions of increasing responsibility at CITGO Petroleum in Tulsa. A native of Pryor, Oklahoma, Burdick earned a Bachelor of Science degree in mathematics in 1988 from the University of Oklahoma in Norman and a Master of Business Administration degree in 1995 from Oklahoma State University in Stillwater."}, {"name": "J. Phillip May", "description": " Phill May is vice president, natural gas pipelines of ONEOK Partners, where he is responsible for interstate and intrastate natural gas pipelines and storages.  May joined the company’s Oklahoma Natural Gas division in 1981 as a customer service representative and was promoted into jobs of increasing responsibility until being named director of origination of ONEOK Energy Services Company in 1998. He was named vice president, commercial, of the interstate pipelines in 2006, and vice president, commercial - natural gas pipelines of ONEOK Partners in 2010, responsible for commercial and business development activities of the partnership’s natural gas pipelines and storage businesses. He assumed his current position in February 2012.  A native of Guthrie, Oklahoma, May earned a Bachelor of Science degree in business administration in 1996 and a Master of Business Administration degree in 1999 from Oklahoma City University.  "}, {"name": "James C. Day", "description": " James Day served as chairman of the board of Noble Corporation, a Texas-based offshore drilling contractor until May 2007. He served as chairman of the board since 1992, as chief executive officer from 1994 to October 2006, and as president of Noble Corporation from 1984 to 1999 and again from 2003 to February 2006. Mr. Day is also a director of Tidewater, Inc. and is a trustee of The Samuel Roberts Noble Foundation, Inc. He served, and has served, on the boards of numerous civic and business organizations and not-for-profit associations."}, {"name": "Julie H. Edwards", "description": " Julie Edwards served as senior vice president - corporate development of Southern Union Company from November 2006 to January 2007 and as senior vice president and chief financial officer of Southern Union from July 2005 to November 2006. From April 2000 to June 2005, she was executive vice president - finance and administration and chief financial officer of Frontier Oil Corporation. Edwards also serves on the board of directors of Noble Corporation and NATCO Group, Inc. She is also a member of the board of directors of ONEOK Partners, L.P."}, {"name": "William L. Ford", "description": " William Ford has served as president of Shawnee Milling Company since 1979. He serves, and has served, on the boards of numerous civic and business organizations and not-for-profit associations."}, {"name": "John W. Gibson", "description": " John Gibson is non-executive chairman of the board of ONEOK, ONEOK Partners and ONE Gas. He most recently was chairman and chief executive officer of both ONEOK and ONEOK Partners after serving as chairman, president and chief executive officer of ONEOK and ONEOK Partners. Gibson joined ONEOK in 2000 as president of energy, responsible for the company’s natural gas gathering and processing, and transportation and storage businesses. In 2006, he was named president and chief operating officer of ONEOK Partners, the master limited partnership that contains the midstream natural gas and natural gas liquids businesses. He was elected chief executive officer of ONEOK and president and chief executive officer of ONEOK Partners in January 2007, becoming chairman of ONEOK Partners later that year. In January 2010, he became president of ONEOK; and in May 2011, he became chairman. Gibson began his career in the energy industry in 1974 as a refinery engineer with Exxon Company, USA. He spent 18 years with Phillips Petroleum Company in a variety of domestic and international positions in the natural gas, natural gas liquids, and exploration and production businesses. When Gibson left Phillips in 1995, he was vice president of marketing of GPM Gas Corporation, a wholly owned natural gas gathering, processing and marketing subsidiary. Prior to joining ONEOK, Gibson was executive vice president of Koch Energy, Inc., a subsidiary of Koch Industries, responsible for its interstate natural gas pipelines and gathering and processing businesses. A native of Kansas City, Kansas, Gibson earned an engineering degree in 1974 from the University of Missouri at Rolla, now called Missouri University of Science and Technology. He also is a graduate of the Harvard Business School’s Advanced Management Program."}, {"name": "Bert H. Mackie", "description": " Bert Mackie is vice chairman of the Security National Bank in Enid, Oklahoma, where he has served since 1962 in all facets of commercial banking. He also serves as a director of the Security Financial Services Corp. and is asset manager of Hamm Financial Group. Mr. Mackie served as an officer or director of many educational and business organizations, including past president of the board of trustees of the Oklahoma Foundation for Excellence, Regent for the Oklahoma Banking Association Intermediate School of Banking, and also the board of governors of St. Mary's Regional Medical Center. He is past chairman of the Garfield County Joint Industrial Foundation and Treasurer of the Enid Economic Coalition. He also serves on the Northwestern Oklahoma State University/Northern Oklahoma College Community Advisory Board and their respective foundations."}, {"name": "Steve J. Malcolm", "description": " Steve Malcolm served as chairman, president and chief executive officer of Tulsa-based Williams until January 2011.  During his 26-year career with Williams, Malcolm held numerous leadership positions of increasing responsibility, including president and chief executive officer of Williams Energy Services from 1998-2001; senior vice president and general manager of midstream natural gas and natural gas liquids in 1996; and senior vice president and general manager of natural gas gathering and processing from 1994-96. He was named chairman of Williams in May 2002, chief executive officer in January 2002 and president and chief operating officer of Williams in September 2001. Malcolm joined Williams in 1984 as director of business development of Williams Natural Gas Company. Prior to joining Williams, he worked for Cities Service Company in its refining, marketing and transportation business. Malcolm serves, and has served, on the boards of numerous civic, business and industry organizations."}, {"name": "Jim W. Mogg", "description": " Jim Mogg served as chairman of the board of DCP Midstream GP, LLC from August 2005 to April 2007. From January 2004 to September 2006, he served as group vice president, chief development officer and advisor to the chairman of Duke Energy. Mr. Mogg served as president and chief executive officer of DCP Midstream, LLC from December 1994 to March 2000, and as chairman, president, and chief executive officer from April 2000 through December 2003. Mr. Mogg was vice chairman of TEPPCO Partners, LP from April 2000 to May 2002 and chairman of TEPPCO Partners, LP from May 2002 to February 2005. Mr. Mogg also serves on the board of directors of Bill Barrett Corporation."}, {"name": "Pattye L. Moore", "description": " Pattye Moore is a business strategy consultant and author of Confessions From The Corner Office, a book on leadership instincts. In addition to serving on the ONEOK Board of Directors, she also serves on the board of directors for QuikTrip Corporation and Red Robin Gourmet Burgers. Ms. Moore was on the board of directors for Sonic Corp. from 2000 to 2006 and was president of Sonic from January 2002 to November 2004. She held numerous senior management positions during her 12-year tenure at Sonic, including executive vice president, senior vice president - marketing and brand development and vice president - marketing. She also chairs the board of visitors for the Gaylord College of Journalism at the University of Oklahoma."}, {"name": "Gary D. Parker", "description": " Gary Parker, a certified public accountant, is the majority shareholder of Moffitt, Parker & Company, Inc., and has been president of the firm since 1982. He is a director of First Muskogee Financial Corp. and the First National Bank of Muskogee, Oklahoma."}]}