{"about": "Accessing pages and materials on this website constitutes your agreement to the Terms and Conditions of Use , most recently updated October 17, 2014.", "name": "National Oilwell Varco", "members": [{"name": "Paal Kibsgaard", "description": " Paal Kibsgaard is chairman and chief executive officer of Schlumberger Limited. He served as the company’s chief executive officer from August 2011 until assuming his current role in April 2015. Prior to this position, Kibsgaard held a variety of global senior management positions in Schlumberger Limited including chief operating officer; president of the Reservoir Characterization Group; vice president of Engineering, Manufacturing and Sustaining; and vice president of Human Resources. Earlier in his Schlumberger career, Kibsgaard was GeoMarket manager for the Caspian region after holding various field positions in sales and marketing, and customer support.  A petroleum engineer with a master’s degree from the Norwegian Institute of Technology, Kibsgaard began his career in 1992 working for ExxonMobil. In 1997, he joined Schlumberger as a reservoir engineer in Saudi Arabia."}, {"name": "Gerard Martellozo", "description": " Gerard Martellozo is vice president Human Resources, a position he assumed in June 2014. With over\r\n20 years of senior positions in the Schlumberger personnel function, he assumed the role of senior advisor to the chief executive officer in August 2012. Prior to this role he was personnel manager of Drilling Group where he contributed to the successful integration of Smith International and Geoservices. Martellozo joined Schlumberger in 1979 as a field engineer in wireline operations in Europe. He progressed into operations management with assignments in Spain, Italy, France, Nigeria, Algeria and Venezuela. He then transitioned into personnel, moving through most of the company’s oilfield services businesses before being involved in the restructuring of Schlumberger into a pure oilfield services company. Martellozo holds a master of engineering degree from Ecole Nationale Superieure de l’Aeronautique et de l'Espace in Toulouse, France. He is one the founders of Partnerjob.com and has served as its treasurer since 2003."}, {"name": "Ashok Belani", "description": " Ashok Belani is executive vice president Technology, a position he assumed in August 2011. Belani leads the Schlumberger Engineering, Manufacturing and Sustaining organization in addition to supervising the company’s research activities. Prior to this appointment Belani served as president, Reservoir Characterization and earlier as chief technology officer. Belani joined Schlumberger as a field engineer in 1980 and worked for 10 years in different field positions in operations, sales, and management. He then transferred to product development and held positions in engineering, marketing and technique, and technology management. He served as vice president of Marketing and Product Development for Wireline and later as vice president of Marketing and Product Development for Oilfield Services. He later held the position of chief information officer of Schlumberger Limited. From 2003 to 2005, Belani led the effort to divest the semiconductor equipment business from Schlumberger, listed the subsequent company on the Nasdaq stock exchange, and then merged it with Credence Systems. Belani studied electrical engineering in India and holds a master’s degree in petroleum engineering from Stanford University. He serves on the Advisory Board for the School of Earth Sciences at Stanford University, and Institute Physique du Globe, Paris."}, {"name": "Simon Ayat", "description": " Simon Ayat is executive vice president and chief financial officer of Schlumberger Limited. Prior to assuming his current role, Ayat served as the company’s vice president Treasurer, and previously held the position of vice president Controller and Business Processes. Ayat’s career with Schlumberger, which began in 1982, spans a variety of management positions from Paris, Houston and Dallas to the Middle East and Far East regions. His assignments have included serving as Oilfield Services group controller; vice president finance for non-oilfield activities; GeoMarket manager, Indonesia; Sedco Forex regional vice president, Asia; group controller for Wireline; and region controller for Wireline in the Far East and for Sedco Forex in North and South America. He began his career as controller for the Forex Neptune drilling division. Ayat graduated from the University of San Francisco where he received a bachelor’s degree in business administration with an emphasis on finance and accounting."}, {"name": "Alex Juden", "description": " Alex Juden is secretary and general counsel, a position he assumed in April 2009. Juden is responsible for compliance with all NYSE and Securities and Exchange Commission requirements. He is primary contact and relationship manager with the company’s independent directors; primary internal caretaker of corporate governance; and head of the global legal function. Juden joined Schlumberger in 2000 as litigation counsel for Schlumberger Limited. Prior to 2000, Juden held legal positions in various Texas State and Federal litigation practices. Prior to practicing law, Juden served seven years in the United States Navy as a naval aviator. Juden holds a bachelor’s degree in history and political science from Rice University, and a juris doctorate degree from University of Houston Law Center, both in Texas."}, {"name": "Patrick Schorn", "description": ""}, {"name": "Aaron Gatt Floridia", "description": ""}, {"name": "Khaled Al Mogharbel", "description": " Khaled Al Mogharbel is president of the Drilling Group, a position he assumed in July 2013. Prior to his current role, he held various regional management positions including president for Schlumberger Middle East from August 2011 to June 2013; and previously, vice president and managing director for Saudi Arabia, Kuwait & Bahrain. Earlier in his Schlumberger career, Al Mogharbel held various management and engineering positions from 1997 to 2002 in Saudi Arabia, Oman, Bahrain, and UAE. In 2002, he was assigned as Wireline operations manager for China & Japan. Later in 2004, he was appointed general manager for Syria, Jordan and Lebanon; and in 2007 he was assigned as global career planning manager based in Paris, France. He began his career with Schlumberger in 1993 in wireline operations in Saudi Arabia. Al Mogharbel holds a bachelor of science degree in mechanical engineering from the University of California, Berkeley. He is an active member of SPE since 1993."}, {"name": "Sherif Foda", "description": " Sherif Foda is president of the Production Group, a position he assumed in July 2013. Prior to his current role, he held various management positions including president for Schlumberger Europe & Africa; vice president and managing director for Saudi Arabia, Kuwait & Bahrain; vice president for Well Intervention; vice president for Well Services for Europe, Caspian & Africa; and GeoMarket manager for Oman. Earlier in his Schlumberger career, Foda held operations management, marketing and engineering positions in UAE, Qatar, Yemen & the Arabian Gulf, United States, Germany and Eastern Europe. He began his career with Schlumberger in 1993 in well services operations in the Red Sea in Egypt. Prior to joining Schlumberger, Foda worked in the information technology industry for two years. Foda holds a bachelor of science degree in electronics engineering and automatic control from Ain Shams University in Cairo, Egypt."}, {"name": "Thomas Teipner", "description": ""}, {"name": "Hinda Gharbi", "description": ""}, {"name": "Steve Kaufmann", "description": ""}, {"name": "Amerino Gatti", "description": ""}, {"name": "Hatem Soliman", "description": ""}, {"name": "Amir Nessim", "description": ""}, {"name": "David Paterson", "description": ""}, {"name": "Olivier Le Peuch", "description": ""}, {"name": "Tony Bowman", "description": ""}, {"name": "Malcolm Theobald", "description": ""}, {"name": "Monday Okoro", "description": ""}, {"name": "Catherine MacGregor", "description": ""}, {"name": "Maurice Nessim", "description": ""}, {"name": "Murat Aksoy ", "description": ""}, {"name": "Kyel Hodenfield", "description": ""}, {"name": "Marwan Moufarrej", "description": ""}, {"name": "Uwem Ukpong\n", "description": ""}, {"name": "Guy Arrington", "description": ""}, {"name": "Sameh Hanna", "description": ""}, {"name": "Stephanie Cox", "description": " Stephanie Cox is vice president, Human Resources, a position she assumed in May 2009. Prior to this current role, she held various management positions including vice president for Gulf of Mexico; human resources manager for North and South America; and global oilfield services information technology manager. Earlier in her Schlumberger career, Cox held various leadership positions in human resources, manufacturing and supply chain services in multiple technology centers. She began her career with Schlumberger in 1991 in the supply chain organization. Cox holds a Bachelor of Arts in materials management from Michigan State University. She is a member of the Schlumberger Gender Balance Steering Committee; a board member of the Schlumberger Foundation; and a management sponsor of Connect Women, a network within Schlumberger. Cox is also a board of trustee member to the American School of Paris."}, {"name": "Gokhan Saygi", "description": ""}, {"name": "Cheng Xu", "description": ""}, {"name": "Rajeev Sonthalia", "description": ""}, {"name": "Demos Pafitis", "description": ""}, {"name": "Simon Bittleston", "description": ""}, {"name": "Jeff Spath", "description": ""}, {"name": "Dan Domeracki", "description": ""}, {"name": "Simon Farrant", "description": ""}, {"name": "Patrick Schorn ", "description": " Patrick Schorn is president of Operations & Integration, a position he assumed in July 2013. Prior to his current role, he held various global management positions including president of the Production Group; president of Schlumberger Well Services; president, Schlumberger Completions; and previously, marketing manager for Well Services. Earlier in his Schlumberger career, Schorn was general manager for the Russia GeoMarket after holding management and engineering positions in France, US Gulf of Mexico, Peru, Argentina and Russia. He began his career with Schlumberger in 1991 in stimulation operations in Europe. Schorn holds a bachelor of science degree in oil and gas technology from the University “Noorder Haaks” in Den Helder, the Netherlands. "}, {"name": "Wellhead Desanding", "description": ""}]}