{"about": "Accessing pages and materials on this website constitutes your agreement to the Terms and Conditions of Use , most recently updated October 17, 2014.", "name": "National Oilwell Varco", "members": [{"name": "Crescent Dunes", "description": " SolarReserve Crescent Dunes Project Update October 2013 Crescent Dunes Solar Energy Project Part 2: Building the Power Plant-The Window-WIRED His efforts have resulted in the development of a portfolio of 800 megawatts (MW) of concentrating solar power (CSP) projects in Chile, a 1,500 MW portfolio of both CSP and PV in the United States, and 300 MW of solar projects in Central America.  Georgis led the development and financing of SolarReserve’s flagship Crescent Dunes 110MW project in Nevada, the world’s first utility scale CSP project with integrated molten salt energy storage. Georgis was instrumental in the opening of SolarReserve’s offices in Chile and Australia to serve these rapidly expanding regional markets, and is in the process of advancing strategic partnerships that will facilitate the deployment of the company’s advanced technology in China."}, {"name": "Utility Industry", "description": "  Grikas joined SolarReserve from Petra Solar where she was Vice President of Communications, leading the Product Marketing and Communications organizations. She formed the company’s global marketing and PR strategy for North America, Europe and MENA regions. Prior to Petra Solar, Grikas was Vice President of Product Management for Vonage, a leading provider of broadband telephone services.  Grikas defined, developed, launched, and lifecycle-managed the company’s next generation consumer services including products, features and pricing delivered to Mobile, PC and other new internet connected devices.  In her prior role at Vonage, she was the Executive Director of Engineering and was responsible for facilitating the design, manufacturing and deployment of innovative voice-over internet protocol (VoIP) products and services. Grikas joined Vonage from Globespan, a semiconductor solution provider for broadband communications, where she was the Director of Global Technical Publications and Training.  She also served as a consultant in the area of electrical equipment qualification engineering for the nuclear power industry."}, {"name": "Mining Industry", "description": "  Grikas joined SolarReserve from Petra Solar where she was Vice President of Communications, leading the Product Marketing and Communications organizations. She formed the company’s global marketing and PR strategy for North America, Europe and MENA regions. Prior to Petra Solar, Grikas was Vice President of Product Management for Vonage, a leading provider of broadband telephone services.  Grikas defined, developed, launched, and lifecycle-managed the company’s next generation consumer services including products, features and pricing delivered to Mobile, PC and other new internet connected devices.  In her prior role at Vonage, she was the Executive Director of Engineering and was responsible for facilitating the design, manufacturing and deployment of innovative voice-over internet protocol (VoIP) products and services. Grikas joined Vonage from Globespan, a semiconductor solution provider for broadband communications, where she was the Director of Global Technical Publications and Training.  She also served as a consultant in the area of electrical equipment qualification engineering for the nuclear power industry."}, {"name": "Press Releases", "description": ""}, {"name": "Kevin Smith", "description": " Smith brings 30 years of energy industry experience to his role as SolarReserve’s CEO. He has held senior executive positions with many successful energy companies aimed at developing solar and wind energy projects as well as natural gas, oil and biomass-fueled electricity facilities. Throughout his career, Smith has actively led the development, financing and construction of privately-owned energy projects in fifteen countries and five continents around the world. These constructed projects total more than 5,000 megawatts with long-term electricity sales contracts in excess of $55 billion. Prior to joining SolarReserve, Smith was Senior Vice President at Invenergy LLC where he successfully drove the development of Invenergy Wind from a startup in 2004 to one of the largest privately-owned renewable energy businesses in the world with more than $2.0 billion of projects in operation. Smith was also President of Insight Energy, Chief Operating Officer of London-based Rolls-Royce Power Ventures, and Vice President - General Manager of Indeck Energy Services. Smith earned his MBA in Finance from the University of Chicago and his Mechanical Engineering degree from Purdue University. A licensed Professional Engineer, Smith was honored with the Outstanding Mechanical Engineer Award from Purdue University in 2008, and in 2012, Platts Energy awarded him the Rising Star Award for vision and leadership in the worldwide energy industry."}, {"name": "Tim Rosenzweig", "description": " Rosenzweig brings more than 20 years of financial and senior executive experience, primarily in the renewable energy sector, to his role as SolarReserve’s CFO. A proven leader, he has extensive industry knowledge and a long history of success in financial transactions with expertise in both domestic and international markets. Rosenzweig joined SolarReserve from Goldwind USA, the US subsidiary of Goldwind Group, where he was Chief Executive Officer. Goldwind Group is the largest manufacturer or wind turbines in China and the second largest globally. At Goldwind USA, which he founded in 2010, Rosenzweig built an accomplished team with significant presence in the wind industry. He also played a critical role in the creation of Goldwind Capital to provide financing for Goldwind projects throughout the Americas. Rosenzweig served as Chief Financial Officer of the Boston-based wind developer, First Wind. As one of the co-founders of First Wind’s predecessor, UPC Wind, he led the company’s capital-raising efforts which exceeded $2.2 billion in debt, tax equity and private equity. Before First Wind, he was Vice President at a Nomura-backed private equity fund in New York and GE Capital Market Services group in Hong Kong, Singapore and the US. He began his financial and international career in 1992 as an analyst for Lehman Brothers’ utilities and project finance group in New York and Hong Kong. Rosenzweig earned his Master of Business Administration from Columbia University. He holds a Bachelor of Science in Civil Engineering from The John Hopkins University."}, {"name": "Tom Georgis", "description": " His efforts have resulted in the development of a portfolio of 800 megawatts (MW) of concentrating solar power (CSP) projects in Chile, a 1,500 MW portfolio of both CSP and PV in the United States, and 300 MW of solar projects in Central America.  Georgis led the development and financing of SolarReserve’s flagship Crescent Dunes 110MW project in Nevada, the world’s first utility scale CSP project with integrated molten salt energy storage. Georgis was instrumental in the opening of SolarReserve’s offices in Chile and Australia to serve these rapidly expanding regional markets, and is in the process of advancing strategic partnerships that will facilitate the deployment of the company’s advanced technology in China. Georgis has more than 27 years of development and operational experience in the energy, technology, and government service sectors.  He has held several senior management positions and his diverse expertise includes structuring transactions for energy and infrastructure projects, leading all aspects of energy project acquisition and managing greenfield project development. Georgis joined SolarReserve from GlobalTec Solutions, a privately-held technology company, where he was Managing Director of International and oversaw all aspects of the company’s international expansion.  Georgis was also Principal and Managing Director at Exodus Energy LLC, a Houston-based privately held power and natural gas firm. While at Exodus, he focused on the development and acquisition of energy assets and acted as lead developer on several multi-million dollar innovative technology energy facilities.  These facilities included natural gas storage, offshore LNG regasification and petroleum coke gasification.  Prior to joining Exodus, he was a manager at Enron Corporation where he developed and structured energy asset projects internationally. Georgis earned his Masters of Business Administration from the Anderson School at the University of California Los Angeles.  Georgis also holds a Bachelor of Arts degree in International Studies from Northwestern University.  Georgis served nine years as a Naval Special Warfare Officer in the United States Navy.  He also serves on the board of the Price Center for Entrepreneurial Studies at the UCLA Anderson School of Management. "}, {"name": "Alistair Jessop ", "description": " SolarReserve Crescent Dunes Project Update October 2013 US firms aid South Africa to ramp up solar capacity SolarReserve - Concentrated Solar Power Technology Animation Crescent Dunes Solar Energy Project Part 2: Building the Power Plant-The Window-WIRED His efforts have resulted in the development of a portfolio of 800 megawatts (MW) of concentrating solar power (CSP) projects in Chile, a 1,500 MW portfolio of both CSP and PV in the United States, and 300 MW of solar projects in Central America.  Georgis led the development and financing of SolarReserve’s flagship Crescent Dunes 110MW project in Nevada, the world’s first utility scale CSP project with integrated molten salt energy storage. Georgis was instrumental in the opening of SolarReserve’s offices in Chile and Australia to serve these rapidly expanding regional markets, and is in the process of advancing strategic partnerships that will facilitate the deployment of the company’s advanced technology in China. Georgis has more than 27 years of development and operational experience in the energy, technology, and government service sectors.  He has held several senior management positions and his diverse expertise includes structuring transactions for energy and infrastructure projects, leading all aspects of energy project acquisition and managing greenfield project development. Georgis joined SolarReserve from GlobalTec Solutions, a privately-held technology company, where he was Managing Director of International and oversaw all aspects of the company’s international expansion.  Georgis was also Principal and Managing Director at Exodus Energy LLC, a Houston-based privately held power and natural gas firm. While at Exodus, he focused on the development and acquisition of energy assets and acted as lead developer on several multi-million dollar innovative technology energy facilities.  These facilities included natural gas storage, offshore LNG regasification and petroleum coke gasification.  Prior to joining Exodus, he was a manager at Enron Corporation where he developed and structured energy asset projects internationally. Georgis earned his Masters of Business Administration from the Anderson School at the University of California Los Angeles.  Georgis also holds a Bachelor of Arts degree in International Studies from Northwestern University.  Georgis served nine years as a Naval Special Warfare Officer in the United States Navy.  He also serves on the board of the Price Center for Entrepreneurial Studies at the UCLA Anderson School of Management. "}, {"name": "Stephen Mullennix", "description": " Mullennix brings 19 years of experience in the infrastructure and energy industries to his role. Throughout his career, Mullennix has worked in concert with financial and technical teams to commercialize breakthrough first-of-its-kind technologies in complex industries. He has held senior positions in numerous successful infrastructure companies across the energy, engineering design services and wastewater sectors. Mullennix has negotiated numerous capital raises, investments, divestitures and project arrangements including joint ventures, power purchase agreements, EPC contracts, technology supply agreements, fuel contracts and O&M contracts. Mullennix has led asset management activities and provided oversight of a myriad of projects spanning solar and other renewable energy sectors, as well as transportation, facilities and water/wastewater industries. Mullennix joined SolarReserve from US Renewables Group, the founding investor in SolarReserve, where he was a Managing Director. He was actively involved in the initial founding of SolarReserve and has worked with the management team and the company’s investors since inception in 2007. Additionally, Mullennix successfully led the acquisition, management and disposition of multiple investments in US Renewable Group’s three investment funds totaling more than $750 million of equity capital. Prior to joining US Renewables Group, Mullennix was Associate Vice President at AECOM Technology Company (NYSE: ACM) where he assisted in closing nine M&A transactions and preparing AECOM for its initial public offering. Mullennix was a Co-Founder of Ennix Incorporated, a family wastewater business which serves small municipalities. Mullennix earned a Master of Business Administration (with Honors) from the Anderson School at University of California Los Angeles. He holds a Bachelor of Arts degree in Economic Geography from Dartmouth College where he graduated Phi Beta Kappa and summa cum laude."}, {"name": "Sumeet Bidani", "description": " Bidani has more than 17 years of experience in the energy industry which includes over 1.5 gigawatts of project development and construction experience. He has held senior executive positions with successful energy companies having a global footprint. Bidani’s industry experience spans IPP, Electric Utility, EPC and Project Development for fossil fuel, renewable energy and new technology projects. Throughout his career, Bidani has led project acquisitions, sales, development, financing and asset planning activities and has negotiated numerous power purchase agreements, EPC contracts, joint ventures and shareholder agreements. Bidani joined SolarReserve from Moser Baer Clean Energy, a dominant Indian power project developer and independent power producer with operations in India and internationally that include 450 megawatts of operational PV projects and about 4,000 megawatts of power projects under advanced development and construction. As Vice President, Bidani headed Moser Baer’s business operations in Europe and the US and was responsible for the company’s growth in emerging markets. Prior to Moser Baer, Bidani was Director of Business Development at Duke Energy within their renewable energy business. At Duke, he also held other positions in strategy, policy and utility operations functions and was instrumental in development, regulatory approvals and commercial deployment of a $3 billion integrated gasification combined cycle power plant, a clean coal technology. Bidani has also worked at ABB Power Generation and was involved in building India’s first private coal and combined cycle power projects after the country’s power generation market was deregulated in the early 1990’s. Bidani earned a Master in Business Administration in Finance from Michigan State University. He also holds a degree in Mechanical Engineering from Aligarh Muslim University in India."}, {"name": "Tim J. Connor", "description": " Connor joined SolarReserve from the Rocketdyne Division of United Technologies where he was the Director of Business Development. In that position, Connor was responsible for leading the design and commercialization of rocket engine derivative energy technologies and products for the renewable, oil and gas and space power markets. While at Rocketdyne, Connor managed a number of highly successful programs, which include the preliminary design and qualification of a 565 megawatt molten salt central receiver, the production of combustor components for large industrial gas turbines; as well as the design, fabrication and supply of critical space flight hardware for the International Space Station electric power system. He was actively involved in the initial founding of SolarReserve while at Rocketdyne, driving the negotiation and execution of the exclusive technology license agreement between Rocketdyne and SolarReserve. Since the inception of SolarReserve, Connor has been instrumental in leading the engineering and deployment of the company’s utility-scale molten salt receiver, heliostat and control system hardware and software systems. Connor earned his MBA from Pepperdine University and his Bachelor of Science Degree in Mechanical Engineering Degree from California State University Northridge."}, {"name": "Pauline Doohan", "description": " Doohan brings more than 20 years of experience as a practicing attorney to her role at SolarReserve. Having been a partner at major US law firms as well as in-house counsel, Doohan’s practice spans finance, corporate and commercial matters, with a specialty in energy and infrastructure-related transactions. Her finance practice included representing lenders and borrowers in a variety of U.S. and cross-border financing transactions, including project financing, acquisition financing, tax-equity financing and syndicated credit facilities. Doohan’s corporate practice included acquisitions, divestitures and joint ventures. For energy clients she also negotiated power purchase agreements, equipment supply agreements, construction contracts, land use agreements and similar contracts. Pauline Doohan joined SolarReserve from Baker & McKenzie where she was a partner negotiating infrastructure and renewable energy transactions, including several that were awarded “Deal of the Year” awards from Project Finance Magazine/Project Finance International. Doohan’s experience in the energy sector began when she was in-house counsel for MCN Energy, the public utility holding company for Michigan Consolidated Gas Company. Doohan is a cum laude graduate of the Honors College at Michigan State University and a cum laude graduate of Wayne State University Law School. A past member of the American Bar Association’s Renewable Energy Subcommittee, Doohan has been a frequent lecturer on renewable energy and infrastructure topics. She is admitted to practice law in both California and Illinois."}, {"name": "Chris Gerlach", "description": " Gerlach leverages more than 18 years of finance experience in his role as VP of Finance. Prior to joining SolarReserve, he worked at several global banking institutions including HSBC and Société Générale. In addition to his knowledge of the solar sector, Gerlach’s diverse background touches multiple other industries including oil & gas, conventional power, transportation infrastructure, and telecommunications in more than 15 countries in the Americas, Europe, the Middle East and Africa. Throughout his career, Gerlach has participated as leader and/or core team member in multiple landmark transactions. Six of these received Project Magazine and/or Project Finance International Deal of the Year Awards. The deal to receive the most recent recognition was the $586 million Letsatsi/Lesedi utility scale photovoltaic projects in South Africa for which SolarReserve acted as the lead developer. Gerlach earned his Master of Science degree in Shipping, Trade and Finance from the Caas Business School in London. He also holds a Bachelor of Science degree (Honours) in Economics and Business Studies from the University of London. Gerlach is multilingual. He speaks English, German, Portuguese and Spanish."}, {"name": "Mary Grikas", "description": " Grikas leads SolarReserve’s integrated marketing and PR efforts across the Americas, Africa, the Asia-Pacific region, the Middle East, and Europe. She has been instrumental in increasing brand awareness globally, supporting the company’s continued growth and expansion into new territories and markets.  Grikas brings extensive communications and engineering experience across a number of technology industries to her role at SolarReserve, including telecommunications, semiconductors, electrical systems and solar power.  Over her career that spans three decades, Grikas has demonstrated success at bringing innovative new products and technologies to the market and in building brands.  Grikas joined SolarReserve from Petra Solar where she was Vice President of Communications, leading the Product Marketing and Communications organizations. She formed the company’s global marketing and PR strategy for North America, Europe and MENA regions. Prior to Petra Solar, Grikas was Vice President of Product Management for Vonage, a leading provider of broadband telephone services.  Grikas defined, developed, launched, and lifecycle-managed the company’s next generation consumer services including products, features and pricing delivered to Mobile, PC and other new internet connected devices.  In her prior role at Vonage, she was the Executive Director of Engineering and was responsible for facilitating the design, manufacturing and deployment of innovative voice-over internet protocol (VoIP) products and services. Grikas joined Vonage from Globespan, a semiconductor solution provider for broadband communications, where she was the Director of Global Technical Publications and Training.  She also served as a consultant in the area of electrical equipment qualification engineering for the nuclear power industry.  Grikas earned a Bachelor of Science degree in Electrical Engineering from the University of New Hampshire.  She holds three patents."}, {"name": "Joel M. Link", "description": " Link brings more than eighteen years of experience in the power generation and high voltage transmission fields to his role at SolarReserve. His background includes detail design engineering, development, permitting, construction management, and technical and financial due diligence reviews for lenders and financial institutions. Link has held senior management positions in a number of successful energy development and consulting companies including those that develop solar and wind energy projects, as well as traditional conventional power plants. Prior to joining SolarReserve, Link was Vice President of Development Central Region for both Element Power US, LLC and Invenergy LLC. While at Invenergy, Link played an instrumental role in the growth of Invenergy from a start-up in 2002 with no assets under ownership to one of the largest privately held renewable energy businesses just seven years later. In these roles, he initiated and led the development of over 1,500 megawatts of wind and solar projects currently under construction or in operation that represent capital costs in excess of $3 billion. Link joined Invenergy from Black & Veatch in Kansas City, MO, where he was a Project Engineer. Link worked in the Independent Engineering and Project Assessment group to provide detailed technical reviews for lenders and financial institutions on projects throughout North America, Asia, Australia and Europe. Link received his Bachelor of Science in Chemical Engineering from the University of Notre Dame."}]}